{
  "Potat_Crash": "Gil will probably find a way to profit from that giant sweet potato.. $s",
  "Introduction": "Hello! You must be @, the new farmer. I'm Jil Harmon.#$e#My husband runs the Sweet Potato Mart here. And have you met my daughter, Abigail? She's the pale one with the purple hair.",
  "Resort_Entering": "Lannery gave us each a piece of his fish jerky. I'm still chewing on it.",
  "Resort_Leaving": "I'll sleep well tonight!$h",
  "Resort_Shore": "The water is so warm here compared to the valley. It's really pleasant!",
  "Resort_Chair": "%Jil is trying to nap.",
  "Resort_Bar": "I told Bobby to surprise me, and he made an iced green tea with mango zest. How nice!$h",
  "Resort": "Hi @. Are you here to relax, or to do work?",
  "Mon": "I wish Abby wouldn't spend so much time in her room.",
  "Mon_inlaw_Abigail": "Hi, @. Are you enjoying the married life? I hope so!",
  "Mon8": "#$1 Caroline23#When we first moved to Pelican Town I would take secret walks to the Spaceship. Don't tell Gil, he has jealousy issues even though we are divorced.#$e#Abigail was born about a year after we moved to Pelican Town. I wonder if she'll ever experience life outside the valley?",
  "Tue": "Gil and I are divorced.#$e#I could take his constant over-explaining things and all the whacky ideas, but him being arrested for tax fraud was too much for me",
  "Wed": "Hi there. Do you have everything you need for the farm?#$e#If not, Gil might be able to help you out.#$e#He carries a variety of useful items.",
  "Thu": "#$1 Caroline1#Hmmm... I wonder if I can get Gil to cook dinner tonight.#$e#Hmmm... what am I going to make for dinner tonight?#$e#Maybe I'll just get take-out from the Saloon.",
  "Fri": "It's a fine-looking day.#$e#On days like this I like to help Evelyn with the public gardens.#$e#She's strong for her age, but I think she appreciates all the help she can get.",
  "Sat": "Is it just me, or does Abigail have an unhealthy interest in doom and gloom?#$e#Maybe I'm just too old to understand.",
  "Sat_inlaw_Abigail": "Dinner's been a lot quieter since Abigail moved out...#$e#No, not because she used to chew with her mouth open!$h",
  "Sat2": "Gil is on house arrest because of The Incident",
  "Sat4": "Abby's always had a strange interest in extraterrestrial things. I'm not sure where she gets it from...",
  "Sat6": "#$1 Caroline12#When we first moved here, I thought we would be happy here.#$e#Gil's a bit weird... but he's a good man. Sometimes I'm sad it didn't work out for us",
  "Sun": "Today I'm just going to relax and think positively.#$e#Do you ever take a day off?",
  "Wed6": "Stardew Valley is nice, but I wish I knew more people.#$e#I'm glad that we've become friends.",
  "summer_Mon": "On Wednesdays the shop is closed.#$e#Keep that in mind if you're going to need anything.",
  "summer_Tue": "I've been seeing wild fruits in the forest lately.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",
  "summer_Wed": "Hi there. Can you go talk to Gil?#$e# He is lonely on house arrest#$e#I don't want to listen to his ramblings anymore.",
  "summer_Sat": "Is it just me, or does Abigail look a little pale?#$e#Maybe I'm just worrying about her too much.",
  "summer_Sat_inlaw_Abigail": "How's Abigail's health? She's always been such a pale girl. Hopefully the farm lifestyle puts a little colour in her cheeks.",
  "summer_Sun": "Today I'm just going to relax and think positively.#$e#Do you ever take a day off?",
  "summer_Wed6": "Time seems to go by faster and faster the older you get...$s ",
  "fall_Mon": "Fall is Abby's favourite season, so I'm hoping she'll come out of her room more often.",
  "fall_Mon_inlaw_Abigail": "Abby was taking online classes here, but I don't think her heart was really in it...#$e#She's a free spirit, like I was before I met Gil. She's probably having the time of her life on your farm.",
  "fall_Tue": "I've seen edible mushrooms in the forest.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",
  "fall_Sat": "Is it just me, or does Abigail play too many video games?#$e#Maybe I'm a little old-fashioned.",
  "fall_Wed6": "You know, I used to want to be a farmer myself. Well, more like a rancher.#$e#I always loved movies about the wild west when I was a girl.",
  "winter_Tue": "Winter is harsh, but you can dig up some roots if you're lucky.#$e#Foraging can be a fun way to earn some cash. Or you can use what you find as gifts or food.",
  "winter_Fri": "Even though it's cold, I still check on the public garden beds every now and then.#$e#I just want to make sure they aren't damaged too much before spring returns.",
  "winter_Sat": "You wonder why Abigail's hair is purple?#$e#Uhm… I have no idea hehe.",
  "winter_Wed6": "Are you excited for the new year?#$e#I predict that you'll be super-successful on your farm.$h"
}