{
    "AcceptBirthdayGift_Positive": "his birthday gift is almost as good as having walls!$h",
    "AcceptBirthdayGift_Negative": "Are you kidding me? You give me this shit on my birthday?$s",
    "WinterStar_ReceiveGift": "Maybe I can sell this to make some money.$h",
    "FlowerDance_Accept": "Who wouldn't want to dance with a clown? I would.",
    "danceRejection": "You think you can go toe to toe with a clown? I don't think so chump..$s",
    "divorced": "...$a#$e#...Leave me alone.$a",
    "breakUp": "*gulp* Oh... Yeah, okay... I guess I should've seen this coming.$s#$b#I'll... uh... guess I'll see you at the pizzaria.",
    "dumped_Guys": "%Wiggles Looks defeated. He won't speak to you.",
    "secondChance_Guys": "Why are you playing with me like this?... *sigh*...",
    "Potat_Crash": "Luckily the sweet potato didn't crash into the hotel. #$b#I've got a whole clown career ahead of me, I can't be out in the field dying.",
    "Saloon_Mon": "I always garnish my Italian cuisine with my grandma's ashes so she can live on inside me forever. God rest her soul.$h",
    "Saloon_Fri": "I haven't eaten for days.",
    "Introduction": "Hey how's it going? I'm Wiggles the Clown.#$e#I'm an entertainer, I entertain kids.#$e#Lemme tell you something about kids..$3#$e#I HATE KIDS.$5",
    "spring_17": "If you're here about lil Vincent's birthday last week...$1#$e#He pushed me first okay. I did not want that to get as ugly as it did.$3.",
    "spring_Sun": "I got a question. #$q 1/2 rich_followup#Do you have any rich relatives who have not yet written their will? #$r 1 25 rich_yes#Sorry, my grandpa left everything to me.#$r 2 -25 rich_no#Slowly back away..",
    "rich_yes": "All right, I guess you're useless.",
    "rich_no": "Hey! Where're going you mook? $a",
    "rich_followup": "If I don't pay my rent, Oscar might take my walls away..#$p 1 #Let me know if you ever get new rich relatives!$h | I don't have time to say hi, I need money! $3",
    "Mon": "Leave me alone you mook",
    "Mon2": "Hey don't touch the jacket!",
    "Mon4": "Hey. I'm not sorry if I came off as rude when we first met.#$e#Just wanted you to know that.",
    "Tue": "I am the most calm clown you will ever see..$5",
    "Tue2": "What do you want from me? Money? I don't have any!$5",
    "Tue4": "Life isn't so bad... at least I have pizza and spaghett.$u",
    "Wed": "I'm barely a clown. $2",
    "Wed2": "I did not choose the clown career, it chose me.$3",
    "Wed8": "Oscar let me stay here after they took my walls.#$e#It stinks here but at least I'm not living under the train tracks anymore.$s",
    "Thu": "What do you want? Leave me alone. I don't want to talk to you, capiche?",
    "Thu2": "If you know anyone who needs a clown for any reason at all, and I mean any reason, call Wiggles the Clown!#%b#That's me.$1",
    "Thu4": "You're really persistent. I get it, this clown is irresistible.$h",
    "Thu6": "I was born this way, can you believe it?",
    "Thu8": "You like talking to me? What the hell is wrong with you?.$h",
    "Fri": "Quit staring at me like that. I swear I don't like it.$2",
    "Fri2": "I will do funerals, but I draw the line at doing double acts with the deceased.$2#$e#It was funny the first time, but it got real awkward real fast.$1",
    "Fri6": "I'll definitely be going to the pizzaria tonight. What else is a clown gonna do?",
    "Sat": "I'm legally declared sane in several baltic states.",
    "Sat2": "I'll entertain a dead skunk if I need to.$h",
    "Sat4": "I'm renting my room from Oscar at a really good price. It's small, but at least there's walls.#$e#If I could reset my life I'd never had taken that Timmy Thompson job.",
    "Sat8": "What are you looking at? Never seen a clown before?!?.$h",
    "Sun": "Nobody will hire me because I smashed one little birthday cake at a party.$2#$e#Okay, maybe I wasn't technically legally supposed to be performing there.$3",
    "Sun2": "Buddy, bothering me will imbue you with the clown curse.$2#$e#You will be visited by many clowns in the night and they will eat all of your spaghetti!$h",
    "Sun4": "Hmm... it's %time. Should I eat spaghett now, or should I wait?",
    "Sun6": "I'm a clown. I'm also very desperate for human contact.$2",
    "Sun10": "Hi, @. I've actually been having a pretty good day so far.$h"
}