{
    "Potat_Crash": "I hope that giant sweet potato will bring more people to our hotel! $h",
    "Introduction": "Hello$u#$b#I'm Oliver, ass. manager at Oscar's Hotel$u",
    "Resort_Entering": "I see a crab!",
    "Resort_Leaving": "I've got sand in my shoe...$s",
    "Resort_Shore": "I'm collecting seashells... they will make for nice decor in the hotel!",
    "Resort": "Oscar told me not to get burnt... But when I walk fast, it feels cool, so I think I'll be okay.$h",
    "reject_869": "Ew, gross!$s",
    "Mon": "I don't know the first thing about running a hotel, but I am using it to further my studies of creatures.$u",
    "Mon4": "Hi, @.#$e#It's fun to run a hotel and sell farm animals on the side.$h",
    "Tue": "What? *giggle*$h#$e#...hi.",
    "Tue6": "Oscar showed me the book \"How to manage a hotel\" which includes all you have to know about the business. ... Shhh... come closer. ... The book actually includes another book. It's called \"How to manage creatures\". That's all you need to know.",
    "Wed": "...$u",
    "Wed2": "...Hi.$u",
    "Wed4": "I would love to go volcano zorbing with Oscar one day!$s#$e#It sounds fun",
    "Thu": "Wiggles keeps asking for 'hot spaghet' for his roomservice.$u",
    "Thu2": "I go to the library to study creatures.$h#$e#There are many interesting books on the topic",
    "Fri": "If you have any hotel questions, please ask Oscar instead$u",
    "Fri2": "Do you like my jacket?",
    "Fri4": "I like living in the hotel... I meet so many interesting people and creatures",
    "Sat": "You smell like grass.$u",
    "Sat2": "Sometimes I look for crawdads in the river. Don't tell Oscar... but I fed one to a cow once.#$e#She loved it.",
    "Sat8": "You're always so nice to me, @.$h#$e#Guests are usually mean, but you're different.",
    "Sun": "Um... d...do you want something?$u#$e#I don't know what to say.$u",
    "Sun2": "Shane's gone a lot, and Oscar is busy all the time... so I have to look out for the hotel alone sometimes.#$e#I'm thankful for all my books.$h",
    "Sun10": "Did you know Shane's my friend?$s#$e#... yes he is capable of having friends you know$s"
}