{
    "Changes": [
        {
            "Action": "EditData",
            "Target": "Strings/SpecialOrderStrings",
            "Entries": {
                "Willy_Objective_1_Text": "Place the bug meat in the barrel next to Lannery's house.",
                "Pierre_Name": "Gil's Prime Produce",
                "Pierre_Text": "Hello there. For an upcoming sca- i mean promotion, I'm thinking of offering some high-quality vegetables at a slight premium... Know where a thrifty shopkeep might find 25 gold-star vegetables?",
                "Pierre_Objective_1_Text": "Place the crops in the empty produce box in Gil's shop.",
                "Gus_Name": "Bobby' Famous Omelet",
                "Gus_Text": "{Greeting}... but I'll need two dozen eggs. Any takers?                -Bobby",
                "Gus_Objective_1_Text": "Put the eggs in Bobby' fridge.",
                "Wizard_Text": "I seek an extremely rare and powerful goop, known as 'ectoplasm'. It can be found in the remains of slain ghosts.      -Tiny Planet Explorer",
                "Wizard_Objective_0_Text": "Deliver an ectoplasm to the Explorer",
                "Clint_Text": "The number of {Monster:LocalizedName} in the local caves have made mining dangerous... for other people, not me! There's good money for anyone willing to slay 50 of them.          -Clunt",
                "Linus_Text": "I have an idea. There's a lot of trash in the water. Why don't we fish some out to make the valley more beautiful?                     -Nintendad",
                "Wizard2_Text": "I require assistance in tracking down the rare and dangerous prismatic slime, within the local caves. Bring me a jar of its prismatic jelly and you will be duly rewarded.        -Tiny Planet Explorer",
                "Wizard2_Objective_1_Text": "Deliver a prismatic jelly to the Explorer"
            }
        },
        {
            "Action": "Editdata",
            "Target": "Data/SecretNotes",
            "Entries": {
                "2": "It's JP's holiday shopping list^^Everyone's favorites^^Sebastian: Frozen Tear, Sashimi^Penny: Emerald, Poppy^Vincent: Grape, Cranberry Candy^Mom: Crispy Bass, Pancakes^Dad: Risotto, Roasted Hazelnuts^Me: Cactus, Maple Bar, Pizza%revealtaste:Sebastian:84%revealtaste:Sebastian:227%revealtaste:Penny:60%revealtaste:Penny:376%revealtaste:Vincent:398%revealtaste:Vincent:612%revealtaste:Jodi:214%revealtaste:Jodi:211%revealtaste:Kent:649%revealtaste:Kent:607%revealtaste:Sam:90%revealtaste:Sam:731%revealtaste:Sam:206",
                "4": "It's a note of Paul's^^Parts still needed for PJ's streaming computer!^^*Gold Bar^*Iridium Bar^*Battery Pack^*Diamond^*Strawberries%revealtaste:Maru:336%revealtaste:Maru:337%revealtaste:Maru:787%revealtaste:Maru:72%revealtaste:Maru:400",
                "5": "It's Penny's handwriting:^^I want to get everyone something they love!^^Mom: Parsnip, Glazed Yams, NO BEER!^Oliver: Fairy Rose, Plum Pudding^Vincent: Pink Cake, Grape^Mr. Mullner: Leek, Fried Mushroom^Granny Mullner: Beet, Tulip%revealtaste:Pam:24%revealtaste:Pam:208%revealtaste:Pam:346%revealtaste:Jas:595%revealtaste:Jas:604%revealtaste:Vincent:398%revealtaste:Vincent:221%revealtaste:George:20%revealtaste:George:205%revealtaste:Evelyn:284%revealtaste:Evelyn:591",
                "6": "Bobby's Pizzas Special Orders^^King Bozo: Autumn's Bounty^(Double order of high-fiber bread on the side)^^Oscar: Pumpkin Pie^(extra whipped cream!)^^Bababooey: Bean Hotpot^(Make it spicy)^^Jil: Fish Taco^(she wants triple the sauce! Better throw in a few extra napkins...)%revealtaste:Lewis:235%revealtaste:Marnie:608%revealtaste:Demetrius:207%revealtaste:Caroline:213",
                "7": "It's a page from someone's diary...^^...There are only a few 'older' bachelors in town, and none of them are perfect! Buoy is a bit foppish and melodramatic, but he does have a nice chin. He likes crab cakes and pomegranates.^^Shane is messy and anti-social. But I think his gruff exterior is a defense mechanism, insulating his softness from the world. He likes Beer, Pizza, and Pepper Poppers.%revealtaste:Elliott:732%revealtaste:Elliott:637%revealtaste:Shane:346%revealtaste:Shane:206%revealtaste:Shane:215",
                "9": "Buff Buoy's Strength Training Diet:^^*Complete Breakfast^*Salmon Dinner^^(I've learned to love this food... I can feel the protein!!)%revealtaste:Alex:201%revealtaste:Alex:212"
            }
        },
        {
            "Action": "Editdata",
            "Target": "Data/Quests",
            "Entries": {
                "1": "Location/Meet The Explorer/You received a letter from the local astronaut. He claims to have information regarding the old community center./Enter the Explorer's spaceship./WizardHouse/-1/0/-1/false",
                "3": "Basic/The Mysterious Qi/You've found another note written by 'Mr. Qi'. The request is even more unusual this time./Place 10 beets inside King Bozo' fridge./null/-1/0/-1/false",
                "4": "Basic/The Mysterious Qi/You've found yet another strange note within the King's fridge. This time, the instructions are more cryptic./\"Give the sand dragon his final meal.\"/null/-1/0/-1/false",
                "10": "Basic/Copper Ore/You found a piece of copper ore. You're not sure what you can use it for, but the local blacksmith ought to know./Bring a piece of copper ore to Clunt's blacksmith shop././-1/0/-1/false",
                "12": "ItemHarvest/Smelting/Now that you've built a furnace, you can smelt some metal. According to Clunt's instructions, if you place 5 copper ore and 1 piece of coal in the furnace, it should produce a copper bar./Use your furnace to smelt a Copper Bar./(O)334 1/-1/0/-1/true",
                "13": "Basic/To The Beach/Someone named Captain Lannery Storm invited you to visit the beach south of town. He says he has something to give you./Visit the beach south of town before 5:00pm./-1/-1/0/-1/true",
                "21": "Basic/Oscar's Request/Oscar came by the farm and asked if you'd bring her a cave carrot. She's trying to train her goats to speak, and cave carrot is their favorite snack./Bring a Cave Carrot into Oscar's hotel./-1/-1/0/-1/true",
                "28": "Basic/Dark Talisman/The Wizard asked me to retrieve the magic ink from his ex-wife's house... but to gain access I'll need a dark talisman./Enter the sewer and ask Krobus about the dark talisman./-1/-1/0/-1/false",
                "102": "LostItem/Mayor's \"Shorts\"/King Bozo has lost his purple \"shorts\". He's asking you to find and return them... Discreetly./Find and return King Bozo' purple shorts./Lewis (O)789 AnimalShop 13 7/-1/750/-1/true/You found them... where? ...Oh!...Uhmm...Heh.#$b#There? I have no idea how they could've gotten there...*cough*#$b#This stays between you and me. Got it?$u",
                "104": "ItemDelivery/Crop Research/Bababooey needs a fresh melon for his research./Bring Bababooey a melon./Demetrius (O)254/-1/550/-1/true/This is perfect! It's just what I need for my research. It's going to be hard not to eat it! Thanks a bunch.",
                "105": "ItemDelivery/Knee Therapy/George needs a hot pepper to soothe his aching knee./Bring George a Hot Pepper./George (O)260/-1/200/-1/true/Took you long enough... hmmph... Well it's good and spicy at least. Thanks. Now Fuck off.",
                "106": "ItemDelivery/Cow's Delight/Oscar wants to give her cows a special treat. She's asking for a single bunch of amaranth./Bring Oscar one bunch of amaranth./Marnie (O)300/-1/500/-1/true/Oh, the amaranth I asked for! Thank you so much... my cows are going to love this!$h",
                "107": "LostItem/Blackberry Basket/It's blackberry season, but Nintendad can't find his basket! He's asking you to help him find it. He has no idea where it is./Find Nintendad' basket and return it to him./Linus (O)790 Backwoods 27 27/-1/0/-1/true/My basket! Thank you. This means a lot to me.$h",
                "108": "ItemDelivery/Carving Pumpkins/Caroline wants to carve a pumpkin with her daughter. She asked you to bring her one from the farm./Bring Caroline a pumpkin./Caroline (O)276/-1/500/-1/true/Oh, the pumpkin! It's a good one... Abigail will be so happy when she sees this. Thanks, @!$h",
                "109": "ItemDelivery/Catch A Squid/Lannery is challenging you to catch a squid. He says you can fish them from the ocean on winter nights./Bring Lannery a squid./Willy (O)151/-1/800/-1/true/Hey, you did it! Not bad. Not bad at all. I'm impressed.#$b#Winter's a good time to break out the old fishing rod, isn't it?",
                "110": "ItemDelivery/Clunt's Attempt/Clunt wants you to give Emily an amethyst. He wants you to tell her it's from him./Bring Emily an Amethyst./Emily (O)66/-1/0/-1/true/Oh, my favorite stone! You're so sweet!$h#$b#Huh? It's from who?$u#$b#Oh, you got it at Clunt's? Well I don't care where you got it from, it's beautiful! Thank you! *smooch*$h",
                "111": "ItemDelivery/A Dark Reagent/The Explorer wants you to descend into the mines and fetch him a Void Essence. He needs it for some kind of space research project./Bring Tiny Planet Explorer a Void Essence./Wizard (O)769/-1/1000/-1/true/Ah, you've brought it. You've earned my gratitude, and a 1000g reward. Now go.",
                "112": "ItemDelivery/A Favor For Clunt/Clunt got a new hammer and he wants to test it out on a variety of metals./Bring Clunt an Iron Bar./Clint (O)335/-1/500/-1/true/Hey, it's the iron bar I asked for. It looks strong... perfect.#$b#Thanks, @. I appreciate this.",
                "114": "ItemDelivery/Fish Stew/Bobby wants to make fish stew, but he needs an albacore./Bring Bobby an Albacore./Gus (O)705/-1/400/-1/true/*sniff*...*sniff*... What's that? Something smells like albacore!#$b#Bobby baby! You brought it! Thanks a million!",
                "117": "ItemDelivery/Gil's Notice/Gil will pay \"top coin\" to whoever brings him a plate of sashimi. Apparently he's really craving the stuff./Bring Gil some Sashimi./Pierre (O)227/-1/1000/-1/true/It's about time! I was starting to get the shakes, I wanted this fish so bad. *munch*... Mmm, now that's good.#$b#Thanks, @.$h",
                "118": "ItemDelivery/Aquatic Research/Bababooey is studying the toxin levels of the local pufferfish. He'd like you to bring him one./Bring Bababooey a Pufferfish./Demetrius (O)128/-1/1000/-1/true/There you are. The specimen looks perfect. I'm going to get it on ice straight away. Thanks, @!",
                "120": "ItemDelivery/Mayor's Need/King Bozo wants truffle oil. He won't explain what it's for. Maybe it's none of your business./Bring Lewis a bottle of Truffle Oil./Lewis (O)432/-1/750/-1/true/You got the oil? Let me see...#$b#It's high quality... very slick. Great. Thank you.",
                "121": "ItemDelivery/Wanted: Lobster/Bobby put out a notice requesting a fresh lobster./Bring Bobby a Lobster./Gus (O)715/-1/500/-1/true/Something smells like fresh lobster. Oh, that's good.$h#$b#Take care, friend.",
                "123": "ItemDelivery/Contact the aliens/The Explorer is creating a satellite to contact extraterrestrial life. Who knows who's out there. He needs an iridium bar to finish it./Bring the Explorer an Iridium Bar./Wizard (O)337/-1/5000/-1/true/Ah, precious iridium. You've done well, @. You have my gratitude. Now, leave.",
                "124": "ItemDelivery/Catch a Lingcod/Cpt Lannery is challenging you to catch a Lingcod./Bring Lannery a Lingcod./Willy (O)707/-1/550/-1/true/Hey, that's a real lunker! You've certainly got the angler's blood in you.$h",
                "125": "ItemDelivery/Exotic Spirits/Bobby wants to make a Coco-no-no, but he's missing the main ingredient./Bring Bobby a Coconut./Gus (O)88/-1/600/-1/true/Bobby baby bobby bubbi! Now there's a soothing sight for my winter eyes.$h#$b#It's going to be perfect for my coco-no-no. Thanks!"
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/Objects",
            "Entries": {
                "MagicInkDescription": "You've found the Explorer's lost {0}! Better return it to him.",
                "Spaghetti_Name": "Hot Fresh Spaghett",
                "LobsterBisque_Description": "This delicate soup is a secret family recipe of Lannery's.",
                "PierresMissingStocklist_Name": "Gil's Missing Stocklist",
                "PierresMissingStocklist_Description": "Gil might be interested in this.",
                "WildBait_Description": "A unique recipe from Nintendad that gives you a chance to catch two fish at once."
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/UI",
            "Entries": {
                "Chat_LinusTrashCan": "Nintendad was impressed!"
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/Characters",
            "Entries": {
                "Relative_Uncle": "uncle",
                "Phone_Marnie_Closed": "Hello, you've reached Oscar's Hotel. My business hours are from 9AM to 4PM. Please come visit me then. *beep*",
                "Phone_Marnie_ClosedDay": "Hello, you've reached Oscar's Hotel. My shop is closed today.",
                "Phone_Gus_Closed": "Hello, this is Bobby from Bobby's Pizzas. We're currently closed, but please come by later if you'd like to try our daily special, '{0}'! *beep*",
                "Phone_Gus_Festival": "Hello, this is Bobby from Bobby's Pizzas. We're closed for the day. *beep*",
                "Phone_Pierre_Open": "Gil's Sweet Potato Mart! Oh, hello, @! Yes, I'm open until 5pm today. Please come by for great deals on seeds and produce! Goodbye. *click*",
                "Phone_Pierre_Closed": "Thank you for calling Gil's Sweet Potato Mart. We're closed at the moment, but our hours are 9AM to 5PM. See you then! *beep*",
                "Phone_Pierre_Festival": "Thank you for calling Gil's Sweet Potato Mart. We're closed today in observance of the festival. *beep*",
                "Phone_Clint_Closed": "You've reached Clunt's answering machine. I'm not available right now... My business hours are from 9AM to 4PM. *beep*",
                "Phone_Clint_Festival": "Hey, this is Clunt. I'm taking the day off today. *beep*"
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/StringsFromMaps",
            "Entries": {
                "BathHouse_MensLocker.4": "Buff Buoy's Locker... There's a bunch of pictures of bodybuilders taped inside the door.",
                "Blacksmith.1": "There's a tape inside 'The Essential Blues Collection, vol. 2",
                "Blacksmith.2": "You rifle through Clunt's personal effects. There's a stack of blacksmith aprons, some magazines, an old sword, and a nice picture of his mother.",
                "Blacksmith.3": "You rifle through Clunt's personal effects. There's a stack of blacksmith aprons, some magazines, an old sword, and a nice picture of his mother.",
                "Blacksmith.4": "Dear Emily,^I know you only think of me as a friend.^It's my fault. I'm too shy. I'll never have the courage to tell you the truth.^That's why I'm writing this letter to myself that I'll certainly crumple up and toss in the corner.",
                "Blacksmith.5": "It's a professional-grade furnace. Peering inside, you see molten metal bubbling and churning.",
                "Blacksmith.6": "It's a professional-grade furnace. Peering inside, you see molten metal bubbling and churning.",
                "Blacksmith.7": "Clunt's quality anvil. It's made from an iridium alloy.",
                "Blacksmith.8": "Clunt's quality anvil. It's made from an iridium alloy.",
                "JoshHouse.1": "Momma-^If you're reading this, it means I've passed on. I'm so sorry you had to go through this. Know that I love you both.^Don't be too upset, I'm with Yoba now. ^My final request: take care of Buff Buoy. He needs a family, something stable. He's a good kid.^ Love, ^Clara",
                "JoshHouse.7": "You peek into Buff Buoy's drawer. There's clothes, hair gel, and a box of gridball trading cards.",
                "JoshHouse.8": "You peek into Buff Buoy's drawer. There's clothes, hair gel, and a box of gridball trading cards.",
                "JoshHouse.9": "It's Buff Buoy's gridball helmet. Looks like he keeps it polished.",
                "ManorHouse.1": "King's oven could use a good cleaning.",
                "ManorHouse.3": "Won't you come by tomorrow night?^If you come through the back window no one will notice.^I'd like to see you more often.^I know you're busy but can't you make time for me?^I hope to see you tomorrow.^-O",
                "ScienceHouse.7": "It's some kind of device Paul's working on. It looks pretty scrappy.",
                "SamHouse.9": "JP's electric guitar. It has a pair of active pickups and a whammy bar.",
                "SamHouse.11": "It's JP's computer. He's got an extensive library of computer games.",
                "dogshop.1": "Ramen Shop - Hours 9:00 AM - 8:00 PM",
                "spaceship.1": "Some mysterious fluid.",
                "spaceship.2": "Beep boop!",
                "spaceship.3": "A collection of exquisite things.",
                "spaceship.4": "Don't forget to water your plant friends.",
                "spaceship.5": "Flashing buttons and levers. It looks complicated. Somehow it works despite being on fire. ",
                "spaceship.6": "What is this?",
                "spaceship.7": "The fire extinguisher is empty.",
                "BuoyHouse.1": "It's a big anchor. It looks very heavy.",
                "BuoyHouse.2": "The Buoy's work desk. It's covered in seagull feathers.",
                "BuoyHouse.3": "There's message scratched into the wood: Never get lost again.",
                "BuoyHouse.4": "It's a very tall palm. It's imported from Calico Desert.",
                "BuoyHouse.5": "A globe with pins in it. They all stick in parts of the ocean.",
                "Pizzeria.1": "Oh no, you look fabulous!",
                "Pizzeria.2": "A 'Sabrina the Teenage Witch' marathon is on.",
                "Pizzeria.3": "It's an Italian recipe book, it's opened on a secret veggie chili recipe.",
                "Pizzeria.4": "It's a claw machine full of stuffed toys who look like Sad Ghost.",
                "Pizzeria.5": "Fresh out of the oven.",
                "Pizzeria.6": "The pizza looks delicious.",
                "Pizzeria.7": "Bobby is cooking some bobby baby delicious dishes.",
                "Pizzeria.8": "The box is sealed shut.",
                "Pizzeria.9": "There are frozen steaks in the freezer. They look a bit... sloppy?",
                "Town-Potat.1": "The first batch of a giant sweet potato pie. It smells delicious.",
                "Town-Potat.2": "A giant sweet potato! No one knows where it came crashing from, but it sure looks scrumptious.",
                "Town-Potat.3": "A fragrant vase of summer flowers.",
                "Town-Potat.4": "The baked sweet potatoes look delicious.",
                "Town-Potat.5": "The table is filled with sweet potato dishes.",
                "Town-Potat.6": "Tourist: We came down to Pelican Town as soon as we heard about the giant sweet potato.",
                "Town-Potat.7": "Tourist: I'm a big fan of sweet potatoes, I had to come see this giant one with my own two eyes.",
                "Town-Potat.8": "The sweet potato roast, it is Nintendad's specialty.",
                "Town-Potat.9": "Tourist: Oh my, the sweet potato dishes here are truly excellent.",
                "Town-Potat.10": "Tourist: Pelican Town is known for its sweet potato specialties, but I think they've really outdone themselves this year",
                "Town-Potat.11": "Tourist: I brought my brother to the Sweet Potato Festival. He was so excited about it, he could barely sleep last night!",
                "Town-Potat.12": "Tourist: This is the best day ever!!! The giant sweet potato is my favorite!",
                "Town-Potat.13": "Who would put this rude sign here…?",
                "Town-Potat.14": "Seems like Sweet Potato seeds are on sale today.",
                "Town-Potat.15": "A golden statue honouring the giant sweet potato.",
                "Town-Potat.16": "We were going to bomble, but King Bozo forbid it. He wasn't listening to me when I told him it was nothing like gambling.",
                "Town-Potat.17": "The arrow seems stuck..",
                "Town-Potat.18": "Tourist: It was a long bus ride here, but totally worth it! This valley is so beautiful.",
                "Town-Potat.19": "Bobby made some delicious Sweet Potato dishes.",
                "PJRoom.1": "Welcome to Welwick's Oracle... I sense that one lucky gamer will be showered with good fortune. ",
                "PJRoom.2": "An interesting placement of the bed.",
                "PJRoom.3": "The fridge is filled with salads and spicy eels.",
                "PJRoom.4": "The book is filled with weird challenges.",
                "PJRoom.5": "Leftovers of a salad.",
                "PJRoom.6": "The barrel is overflowing with prismatic shards.",
                "PJRoom.7": "The shoes are well worn.",
                "PJRoom.8": "The sack is filled with prismatic shards.",
                "PJRoom.9": "The wooden box seems handmade. It's filled to the brim with prismatic shards.",
                "PJRoom.10": "The hammer is engraved. It says: Badonk!",
                "PJRoom.11": "'To dew list: 1. Do not talk about Fart Farm.' The other items are all crossed out.",
                "PJRoom.12": "The kitchen looks unused.",
                "PJShop.1": "Fuji looks very comfortable on her bed.",
                "PJShop.2": "It's a poster made by PJ.",
                "PJShop.3": "The shelves are stacked with art supplies.",
                "PJShop.4": "These pots are very well made.",
                "PJShop.5": "PJ's own clothing line.",
                "PJShop.6": "It's a Buoy plushie.",
                "PJShop.7": "A steaming cup of green tea.",
                "PJShop.8": "Hey, this plant's fake!",
                "PJShop.9": "PJ's streaming setup. PJ must be pretty serious about streaming.",
                "PJShop.10": "101 Jonks for Jonkers.",
                "PJShop.11": "It's a poster of a robot in a spotlight.",
                "PJShop.12": "It's filled with trash.. very unexpected.",
                "PJShop.13": "There's 6 cookies on a plate.",
                "PJShop.14": "Smells like pizza.",
                "PJShop.15": "There's a note on the fridge: DO NOT LOOK INSIDE MY FRIDGE - PJ",
                "PJShop.16": "The cabinet is filled with different cloths for crafting.",
                "OscarHotel": "Oscar's hotel for fantastical creatures",
                "OscarHotel.1": "Ding! DING!",
                "OscarHotel.2": "Looks like the guest's mail and room keys are stored here.",
                "OscarHotel.3": "Only hotel guests are allowed upstairs.",
                "OscarHotel.4": "A TV but no connection.",
                "OscarHotel.5": "It looks like white is winning.",
                "OscarHotel.6": "Twilight... interesting.",
                "OscarHotel.7": "Hotelkeeping 101",
                "OscarHotel.8": "So many secrets in this drawer.",
                "OscarHotel.9": "Locked with three different locks.",
                "OscarHotel.10": "Leftovers from the breakfast.",
                "OscarHotel.11": "There are blue feathers on some of the eggs.",
                "OscarHotel.12": "Octochef is hard at work, preparing food for everyone.",
                "OscarHotel.13": "Octochef stares at you blankly..",
                "OscarHotel.14": "This microwave is surprisingly clean.",
                "OscarHotel.15": "The fridge is filled with food from Gil's.",
                "OscarHotel.16": "The milk must be from Oscar's cows.",
                "OscarHotel.17": "Who would eat cookies for breakfast?",
                "OscarHotel.18": "It's supposed to be a baloon animal, you think..",
                "OscarHotel.19": "There's a clown's nose stuffed in the drawer.",
                "OscarHotel.20": "It hasn't been tuned.",
                "OscarHotel.21": "There's one message from Red.",
                "OscarHotel.22": "The sign has 'ADVERT' written on it.",
                "OscarHotel.23": "The spaghetti has weird dust on top of it.",
                "Town.1": "KickthePJ shop - Hours 9:00 AM - 3:00 PM",
                "Town.2": "Sweet Potato Mart Open 9:00 AM to 5:00 PM Closed Wednesdays",
                "Town-Christmas.1": "KickthePJ shop - Hours 9:00 AM - 3:00 PM",
                "Town-Halloween.1": "KickthePJ shop - Hours 9:00 AM - 3:00 PM",
                "Town-EggFestival.1": "KickthePJ shop - Hours 9:00 AM - 3:00 PM",
                "Town-Fair.3": "KickthePJ shop - Hours 9:00 AM - 3:00 PM",
                "SeedShop.1": "'11 Solo Sonatas For The Wooden Flute'",
                "SeedShop.2": "David the Guinea Pig",
                "SeedShop.3": "David the Guinea Pig",
                "SeedShop.4": "'The The Art of Scamming'",
                "SeedShop.5": "'Divorce 101: How to live with your ex'",
                "SeedShop.6": "It's loaded with fresh veggies.",
                "SeedShop.7": "'Journey Of The Prairie King: Console Edition'",
                "SeedShop.8": "'Why JojaCo Must Be Stopped'",
                "SeedShop.9": "To Mr. Gil:^It pains me to be the bearer of bad news, but I feel obligated to inform you of a recent development most threatening to your livelihood.^Joja Co. has decided to expand into Pelican Town.^It's too late for protest. Joja Builders have already broken ground for the new JojaMart.^^This must be devastating news for you. So many years in business...a local standby... and now, obscured by the shadow of a powerful, efficient, economically viable corporation. What a shame!^^As manager of the new JojaMart, I feel, to some degree, personally responsible for your predicament. As such, I'd like to offer you a position as Assistant Grocer. Wages start at 5g an hour. I look forward to seeing your resume!^^-Mr. Fuzzwald, Manager^Pelican Town JojaMart",
                "SeedShop.10": "Spirit Board",
                "SeedShop.11": "This drawer's ",
                "SeedShop.12": "This cupboard is full of exercise equipment."
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/Locations",
            "Entries": {
                "SeedShop_Yoba": "Altar of Yoda",
                "SamHouse_Sam_Trash": "Looks like JP cleans his trash bin regularly.",
                "AnimalShop_Marnie_Absent": "Closed for the day.\n\n-Oscar",
                "Mines_Infested": "This area is infested...",
                "Mines_Overrun": "This area is overrun with monsters.",
                "Mines_Fallen": "You fell {0} levels.",
                "Mines_FallenFar": "You fell {0} levels. Ouch!",
                "Mines_ShaftJumpIn": "Jump In",
                "Mines_Shaft": "If you saw a hole in a cave, would you jump into it?",
                "Mines_LeaveMine": "Eat a ladder snack.",
                "Mines_DoNothing": "You missed a chest. Leave the mines",
                "Railroad_TrainComing": "The forever train is passing through Stardew Valley",
                "Town_SeedShopSign": "- Sweet Potato Mart -\nNow open 7 days a week From 9am-5pm!",
                "Town_PickupTruck": "It's just the back of King Bozo's old pickup truck...",
                "Caroline_Sunroom_Door": "Jil only lets her friends enter here...",
                "AnimalShop_MoneyBox": "I'm visiting the island today. If you need to buy anything, just leave the money in this box!^     -Oscar",
                "Saloon_MoneyBox": "I'm tending the bar on Ginger Island today, but I won't let that stop you from buying something!^     -Bobby",
                "SeedShop_MoneyBox": "I'm taking the day off to visit the island. Please place your money in the box. No cheating!^     -Gil Harmon",
                "ManorHouse_LedgerBook_Singleplayer": "Pelican Town Ledger Book... It looks like the king uses this to keep track of finances.",
                "Railroad_Box_MrQiNote": "'Well done. Your next task: Place 10 beets inside King's fridge. -Mr. Qi'",
                "ManorHouse_MayorFridge_Initial": "It's the mayor's fridge. It's mostly full of milk and iced tea.",
                "ElliottHouse_ElliottBook_Filled": "'{0}' by Buoy ... Dedicated to {1}",
                "ScienceHouse_RobinAbsent": "Sorry! Shop's closed for the day... I'm at Jil's place for aerobics club.\n\n-Robin"
            }
        },
        {
            "LogName": "Cheeky dono",
            "Action": "EditData",
            "Target": "Strings/StringsFromCSFiles",
            "Entries": {
                "Event.cs.1763": "Wha... Yoda...? @, don't... don't you know I'm an atheist? Ugh... $7",
                "Utility.cs.5371": "@... %spouse... #$b# As the king of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you husband and... well, husband!$h",
                "Utility.cs.5373": "@... %spouse... #$b# As the king of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you husband and wife!$h",
                "Utility.cs.5375": "@... %spouse... #$b# As the king of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you wife and... well, wife!$h",
                "Utility.cs.5377": "@... %spouse... #$b# As the king of Pelican Town, and regional bearer of the matrimonial seal, I now pronounce you wife and husband!$h",
                "Buff.cs.470": "Yoda's Blessing",
                "Event.cs.1871": "Lannery, with 5 big, fresh fish!",
                "Object.cs.13078": "Gunther will thank you for the cheeky dono if you donate it to the museum.",
                "Event.cs.1068": "PJ charged me {0}g for the rescue. ",
                "Event.cs.1070": "I have no money, but PJ was obligated to save my life free of charge. ",
                "Event.cs.1584": "Your grange display has been judged. Return to King Bozo for the result!",
                "Event.cs.1597": "Wow, I got a low score. I guess King Bozo isn't much of a fish man. Oh well...$s",
                "Event.cs.1600": "That was some strange-looking purple lettuce in your grange display!$h#$b#I swear, It looked just like King Bozo' special und... $3#$b#Oh!... heh... nevermind!$4",
                "Event.cs.1761": "...You're right. Oliver... Ugh, God... I'm a horrible, *hic*... selfish person.$7#$b#Now I feel even worse...$7",
                "Event.cs.1862": "Vincent!",
                "Farmer.cs.1918": "You received 15 Parsnip Seeds!^^'Here's a little something to get you started.^-King Bozo'",
                "Game1.cs.2634": "near Oscar's Hotel.",
                "Game1.cs.3756": "King Bozo",
                "NPC.cs.3990": "A human visitor? This is most unusual...#$e#I'm Sad Ghost, merchant of rare and exotic goods.",
                "GameLocation.cs.8525": "Come back when Gil's tending the shop.",
                "MapPage.cs.11067": "Explorer's spaceship",
                "MapPage.cs.11068": "Oscar's Hotel",
                "MapPage.cs.11072": "Home of Jodi, Kent & JP",
                "MapPage.cs.11076": "PJ's shop",
                "MapPage.cs.11078": "Sweet Potato Mart",
                "MapPage.cs.11079": "Home of Gil, Jil & Abigail ",
                "MapPage.cs.11083": "Pizzeria",
                "MapPage.cs.11085": "King Bozo's Manor",
                "MapPage.cs.11088": "Buoy's Lighthouse",
                "MapPage.cs.11093": "Home of George, Evelyn & Buff Buoy",
                "MapPage.cs.11095": "Home of Robin, Bababooey, Sebastian & Maru",
                "MapPage.cs.11168": "Buoy's Lighthouse",
                "MapPage.cs.11172": "Stardrop Saloon",
                "ShopMenu.cs.11488": "Welcome to Gil's! ",
                "ShopMenu.cs.11507": "Animal supplies for sale!",
                "ShopMenu.cs.11508": "*sigh*... When the door opened I thought it might be King Bozo.",
                "ShopMenu.cs.11514": "Welcome to Bobby's Pizzas! What can I get ya?",
                "TV.cs.13128": "Ah... I sense that a new viewer has joined us. A lucky gamer from... Stardew Valley? Welcome, welcome!",
                "GrandpaStory.cs.12051": "Dear {0},^^If you're reading this, you must be in dire need of a change.^^The same thing happened to me, long ago. I'd lost sight of what mattered most in life... real connections with other people and nature. So I dropped everything and moved to the place I truly belong.^^^I've enclosed the deed to that place... my pride and joy: {1} Farm. It's located in Stardew Valley, on the southern coast. It's the perfect place to start your new life.^^This was my most precious gift of all, and now it's yours. I know you'll honor the family name, my boy. Good luck.^^Love, Grandpa^^P.S. If King Bozo is still alive say hi to the old guy for me, will ya?",
                "GrandpaStory.cs.12055": "Dear {0},^^If you're reading this, you must be in dire need of a change.^^The same thing happened to me, long ago. I'd lost sight of what mattered most in life... real connections with other people and nature. So I dropped everything and moved to the place I truly belong.^^^I've enclosed the deed to that place... my pride and joy: {1} Farm. It's located in Stardew Valley, on the southern coast. It's the perfect place to start your new life.^^This was my most precious gift of all, and now it's yours. I know you'll honor the family name, my dear. Good luck.^^Love, Grandpa^^P.S. If King Bozo is still alive say hi to the old guy for me, will ya?",
                "MultiplayerUtility.cs.12488": "Your grange display has been judged. Return to King Bozo for the result!",
                "FishingQuest.cs.13228": "The local {0} population is starting to threaten other species. If you can fish {1} of them for me, it would be a big help.   -Bababooey",
                "FishingQuest.cs.13248": "Trying to keep the art o' fishing alive... I'll pay {0}g to any fisherman who catches {1} {2}. Good luck!  -Lannery Storm",
                "FishingQuest.cs.13251": "Trying to keep the art o' fishing alive... I'll pay {0}g to any fishing enthusiast who catches {1} {2}. Good luck!  -Lannery Storm",
                "ItemDeliveryQuest.cs.13311": "Greetings! Bababooey here. Could someone please bring me {0}?\nI'm studying them as part of my biological research.",
                "ItemDeliveryQuest.cs.13314": "Looking to dissect {0}. Please deliver to Bababooey at 24 Mountain Road.",
                "ItemDeliveryQuest.cs.13317": "Howdy neighbors! My goats are really hankerin' for {0}. I can't find any myself! Help?     -Oscar",
                "ItemDeliveryQuest.cs.13320": "Howdy neighbors! I want to try giving my cows {0} to increase their milk production. If you find one could you swing it by for me?.     -Oscar",
                "ItemDeliveryQuest.cs.13446": "A paste of fresh {0} makes a great paint pigment {1}. If you find one, I could put it to good use.       - PJ ",
                "ItemDeliveryQuest.cs.13462": "Hi! I need {0} for a new pizza I'm thinking about. Drop one off at the saloon and I'll be very grateful.     -Bobby",
                "ItemDeliveryQuest.cs.13546": "I require {0} for potion-making. Please deliver directly to my study.     -Tiny Planet Explorer",
                "ItemDeliveryQuest.cs.13548": "Tiny Planet Explorer wishes to study the arcane properties of the {0}. You will be rewarded.",
                "ItemDeliveryQuest.cs.13551": "Need {0} for experiment.    -Tiny Planet Explorer",
                "ItemDeliveryQuest.cs.13553": "Local astronaut in search of a fresh {0}.",
                "ItemDeliveryQuest.cs.13568": "Need {0} for a project I'm working on.    -JP",
                "ItemDeliveryQuest.cs.13571": "Looking for a buddy to bring me {0}.       -JP",
                "ItemDeliveryQuest.cs.13574": "I would like a cute girl to bring me {0}.  (^_-)      -JP",
                "ItemDeliveryQuest.cs.13580": "Need {0} for my latest project. Help!    -Paul",
                "ItemDeliveryQuest.cs.13583": "I need {0} to power my latest invention. It's the ONLY thing that will work!       -Paul",
                "ResourceCollectionQuest.cs.13683": "Thank you!$h",
                "ResourceCollectionQuest.cs.13688": "\n- You can keep the ores after Clunt inspects them.",
                "SlayMonsterQuest.cs.13747": "An invasive crab species is living in the local mine, threatening the native wildlife! These creatures are known for disguising themselves as stones. I'll pay someone to slay {0} of them.  -Bababooey",
                "SlayMonsterQuest.cs.13752": "The monsters known as {0} are throwing the elemental balance into disarray. I would like an adventurer to enter the mines and slay {1} of these {2}.  -Tiny Planet Explorer",
                "WeedingQuest.cs.13816": "Hiring someone to weed the entire town. Once all the weeds are gone, report to King Bozo for payment. Thanks!",
                "WeedingQuest.cs.13824": "Talk to King Bozo",
                "KrobusShopGone": "I'm away. Please leave your payment in the box. -Sad Ghost",
                "ResourceCollectionQuest.cs.13647": "I am looking for someone to bring me {0} {1}s{2}    -Clunt"
            }
        },
        {
            "Action": "EditData",
            "Target": "Data/ExtraDialogue",
            "Entries": {
                "Gunther_NothingToDonate": "Thanks for the cheeky dono!",
                "Morris_PlayerSignedUp": "Excellent! Welcome to Joja Corporation! Come back tomorrow and we can see about getting started on some community development projects... Oh, and don't forget your wallet! Hehe.#$b#Now, let me call King Bozo and see about gutting that nasty old community center...",
                "Morris_ComeBackLater": "Come back tomorrow and we can see about getting some community improvements started... Just make sure to bring a lot of money. Hehe.",
                "Morris_Greeting": "Welcome to JojaMart! How are you doing today?#$b#I don't believe we've met. I'm Fuzzwald, Joja Customer Satisfaction Representative.#$b#When you decide you want to become a Joja Member, I'll be delighted to help make your transition a joyous experience.",
                "Morris_WeekendGreeting_MembershipAvailable": "Welcome to JojaMart! How is your weekend going?#$b#Membership is now available! With a Joja Membership, you'll be able to make improvements in the community with the help of our dedicated personnel... for a fee, of course.#$b#Oh, and another thing... King Bozo promised us that if anyone else joined up, he'd let us turn that old community center into a Joja Warehouse. Isn't that wonderful?#$q -1 -1#Membership costs {0}g. Well, would you like to join us?#$r -1 -1 Yes#Yes.#$r -1 -1 No#No.",
                "Morris_FirstGreeting_MembershipAvailable": "Welcome to JojaMart! How are you doing today?#$b#Membership is now available! With a Joja Membership, you'll be able to make improvements in the community with the help of our dedicated personnel... for a fee, of course.#$b#Oh, and another thing... King Bozo promised us that if anyone else joined up, he'd let us turn that old community center into a Joja Warehouse. Isn't that wonderful?#$q -1 -1#Membership costs {0}g. Well, would you like to join us?#$r -1 -1 Yes#Yes.#$r -1 -1 No#No.",
                "PurchasedItem_1_QualityHigh": "Hey, {0}.#$b# So I stopped by Gil's the other day and bought {1} {2}. It was the first time I've seen one of those there in a while... #$b#I cooked it up for dinner last night... It filled the house with a {3} smell.. It was a hit!$h#$b#I'm glad Gil's stock is starting to expand again.#$e# Anyways...",
                "PurchasedItem_1_QualityLow": "Hey, {0}.#$b# So I stopped by Gil's the other day and bought {1} {2}. It was the first time I've seen one of those there in a while... #$b#I cooked it up for dinner last night... It filled the house with a {3} odor. I don't even want to know where Gil found that thing.$s#$e# Anyways...",
                "PurchasedItem_2_QualityHigh": "Hi... did you sell {1} {2} to the Sweet Potato Mart the other day? I think I bought it...#$e#It was pretty high-quality stuff. I'm impressed.",
                "PurchasedItem_2_QualityHigh_Jodi": "Hi... did you sell {1} {2} to the Sweet Potato Mart the other day? I think I bought it...#$e#It was pretty high-quality stuff. As soon as I smelled it I was back in Granny's old cottage...",
                "PurchasedItem_2_QualityLow": "Hi... did you sell {1} {2} to the Sweet Potato Mart the other day? I think I bought it...#$e#The quality was decent.",
                "PurchasedItem_3_QualityLow_Rude": "I went shopping last night and picked up {1} {2} on sale for only {3}g.#$e# It was {4}! No wonder Gil was selling that {5} for so cheap...",
                "PurchasedItem_4": "So I was at the store the other day and Gil showed me {1} {2} you brought in.#$e#I bought it.$h",
                "PurchasedItem_5_VegetableOrFruit": "I bought the tastiest {2} from Gil's shop the other day. #$b#He said that he grew the thing in his own backyard. I didn't know Gil was such a talented farmer!$h#$b#Looks like you might have some competition, huh?",
                "PurchasedItem_5_Cooking": "I bought the tastiest {2} from Gil's shop the other day. #$b#He said he cooked the thing himself using local ingredients. I didn't know Gil was such {3} {4} chef!",
                "PurchasedItem_5_Foraged": "I bought the tastiest {2} from Gil's shop the other day. He said he found it himself while exploring the mountains. I didn't know Gil was such a talented forager!",
                "PurchasedItem_Elliott": "I saw that Gil had fresh {2} in the shop the other day! Marvelous. It smelled just perfect... and firm, too!",
                "PurchasedItem_Leah": "The other day I bought {1} {2} at Gil's. It was perfect on a bed of greens and a dash of my 'special' vinaigrette.",
                "PurchasedItem_1_QualityHigh_Willy": "Hey, {0}.#$b# So I stopped by Lannery's the other day and bought {1} {2}. I've never seen one so fresh! #$b#So I cooked it up for dinner last night, and it filled the house with a {3} smell.. It was a hit!$h#$b#He told me you caught it yourself... I'm impressed!#$e# Anyways...",
                "PurchasedItem_1_QualityLow_Willy": "Hey, {0}.#$b# So I stopped by Lannery's the other day and bought {1} {2}. He said you caught it yourself! #$b#I cooked it up for dinner last night... and, uh... It filled the house with a {3} odor. I don't even want to know where you found that thing...$s#$e#Anyways...",
                "PurchasedItem_2_QualityLow_Willy": "Hi... did you sell {1} {2} to the Sweet Potato Mart the other day? I think I bought it...#$e#It smelled kind of fishy, but it was alright.",
                "PurchasedItem_3_QualityLow_Rude_Willy": "I went shopping last night and picked up {1} {2} on a 'chum-bucket' sale for only {3}g.#$e# It was {4}! No wonder Lannery was practically giving that {5} away...",
                "PurchasedItem_4_Willy": "So I was at Lannery's other day and he showed me {1} {2} you brought in.#$e#I cooked it up for dinner with some lemon and a side of rice pilaf. Pretty good!$h"
            }
        },
        {
            "Action": "EditData",
            "Target": "Data/Mail",
            "Entries": {
                "Demetrius": "Dear @,^I was conducting a field study the other day, and I found this specimen. ^I hope you find it as interesting as I did.    ^   -Bababooey%item id (O)392 1 (O)394 1 (O)132 1 (O)66 1 %%[#]A Gift From Bababooey",
                "Linus": "Hello, friend.^The mountain lake has been kind to me lately. I'd like to share my good fortune with you.  ^   -Nintendad %item id (O)136 1 (O)143 1 (O)202 1 (O)227 1 (O)228 1 %%[#]A Gift From Nintendad",
                "Pierre": "Dear valued customer,^Thanks for visiting 'Gil's'! Enclosed is your 'Cash-back Rewards Program' rebate. See you soon! ^   -Gil Harmon^  P.S. Sorry for the stock message, @. Enjoy! %item money 250 601  %%[#]A Gift From Gil",
                "Caroline": "Dear @,^Here's a vegetable from the little garden I keep out back. You probably have more veggies than you know what to do with, but oh well.   ^   -Jil%item id (O)190 1 (O)192 1 (O)24 1 %%[#]A Gift From Jil",
                "George": "Found some good quality stone. ^Maybe you can build with it or something.  ^   -George %item id (O)390 35 %%[#]A Gift From George",
                "Lewis": "@,^I'm really glad you've become part of our community! I've enclosed a 500g check from the Stardew Valley Agricultural Fund to help you continue your good work. ^Maybe you can buy some more seeds with it.  ^  Sincerely, King Bozo%item money 500 501 %%[#]A Gift From King Bozo",
                "Gus": "@!^I made you a little treat this morning in the Pizzeria. Dig in!   ^   -Your friend, Bobby%item id (O)224 1 (O)213 1 (O)211 1 (O)207 1 (O)200 1 (O)195 1 (O)198 1 %%[#]A Gift From Bobby",
                "Clint": "Um, Hello...     ^Sorry, I'm not good at writing letters. I made one metal bar too many, and I thought you might need it.  ^   -Clunt, the blacksmith %item id (O)334 1 (O)335 1 (O)336 1 %%[#]A Gift From Clunt",
                "Marnie": "Dear @,^You're such a good neighbor I thought I'd send over some animal feed to make your job easier. Keep it up! ^   -Oscar %item id (O)178 30 %%[#]A Gift From Oscar",
                "Wizard": "Greetings, young adept.^I have enclosed in this package an item of arcane significance. Use it wisely.   ^   -Tiny Planet Explorer%item id (O)422 1 (O)82 1 (O)84 1 (O)70 1 %%[#]A Gift From the Explorer",
                "afterSamShow": "@,^the show was a rockin' success! I wanted to say thanks again for all your help in creating this amazing band. We couldn't have done it without you!   ^   -JP[#]JP's Thank-you Note",
                "afterArtShow": "Dear @,^Thanks again for coming to my art show. It was such a success! I sold nearly all of my sculptures, and everyone was so positive and encouraging! I hope to see you again soon.  ^   -Leah[#]Leah's Thank-you Note",
                "Duck": "Dear @,^You've proven your ability to raise chickens, so I'm now selling ducks at my shop!       ^   -Oscar[#]Ducks For Sale!",
                "Rabbits": "Dear @,^I now have rabbits in the animal shop! They will provide you with fluffy wool ...and more!       ^   -Oscar[#]Rabbits For Sale!",
                "Sheep": "Dear @,^You've proven your ability to raise cows, so I'm now selling sheep at my shop!       ^   -Oscar[#]Sheep For Sale!",
                "Goats": "Dear @,^I now have goats available for purchase at the animal shop. You've done well so far!       ^   -Oscar[#]Goats For Sale!",
                "Pigs": "Dear @,^You've come a long way since you first arrived. As a result, I've decided to start selling pigs at my shop. These pigs are trained at finding gourmet truffles!       ^   -Oscar[#]Pigs For Sale!",
                "SeaAmulet": "@,^I'm going to give you this advice because I like you and I want you to stay in Pelican Town. If there comes a day that you want to ask for someone's hand in marriage, you'll need to give them a 'Mermaid's Pendant'. Don't worry, everyone in Pelican Town understands the significance of the amulet. It's an ancient tradition in this region. Good luck! ^   -King Bozo[#]About Mermaid's Pendants",
                "Bouquet": "@,^It seems like you're starting to get close with some of the townspeople. If you want to show someone that you're romantically interested, you've got to give them one of my beautiful flower bouquets. I'm selling them now, for a very fair price! If you want to start a family someday, this is the first step! ^   -Gil Harmon[#]About Bouquets",
                "DemetriusCooking": "I wanted to say 'thanks' for taking an interest in my work. Here's a cooking recipe that I like. ^   -Bababooey%item cookingRecipe %%[#]Bababooey' Recipe",
                "LinusCooking": "@,^how are you doing? I've enclosed some instructions on how to make one of my favorite fish recipes. ^   -Nintendad%item cookingRecipe %%[#]Nintendad' Recipe",
                "PierreCooking": "TOP SECRET:^Here's the recipe for my famous blueberry tart.^Don't tell anyone! I'm giving it to you because we are such good friends. ^   -Gil Harmon%item cookingRecipe %%[#]Gil's Famous Tart",
                "CarolineCooking": "Dear @,^nothing is more satisfying than cooking with fresh vegetables from your own garden! I've enclosed a recipe to help you out. Take care, ^   -Jil%item cookingRecipe %%[#]Jil's Recipe",
                "GeorgeCooking": "Figured I'd give you this recipe I had laying around. Try not to burn it. ^   -George%item cookingRecipe %%[#]George's Recipe",
                "LewisCooking": "@,^remember to eat healthy, or you won't have enough energy to work hard! I'm including one of my favorite recipes. Make sure to use ripe tomatoes! ^   -King Bozo%item cookingRecipe %%[#]King Bozo's Recipe",
                "GusCooking": "Dear @,^Here's a recipe from my Pizzeria. I only share this with my good friends! ^   -Bobby%item cookingRecipe %%[#]Bobby's Recipe",
                "ClintCooking": "Well, I know a couple of recipes.^I thought I'd send you one... maybe it'll help you mine more ore or something.^Take care. ^   -Clunt%item cookingRecipe %%[#]Clunt's Recipe",
                "MarnieCooking": "Dear neighbor,^when I'm not taking care of animals I like to experiment in the kitchen. Since we've become friends I want to share some recipes with you.^I hope you like this! ^   -Oscar%item cookingRecipe %%[#]Oscar's Recipe",
                "WillyCooking": "Dear @,^I'd like to share an ol' cooking recipe my pappy used to make. It's important the fish is FRESH.  ^   -Lannery Storm%item cookingRecipe %%[#]Lannery's Ol' Recipe",
                "pierreBackpack": "ADVERTISEMENT:^\"I keep finding cool stuff, but my backpack is full!\"^^Does this sound like you? Well, Gil's got you covered!^^Stop by Gil's Sweet Potato Mart TODAY and check out our affordable size 24 backpack!^ See you soon![#]Backpacks From Gil's",
                "pierreHours": "ADVERTISEMENT:^^The Sweet Potato Mart is now open 7 days a week![#]Gil's Extended Hours",
                "quest10": "@,^I've heard you've been giving some people a hand around town! Everyone seems really thankful. I'm awarding you this month's \"Best Neighbor\" award (with a small cash prize). Keep it up! ^   -King%item money 500 501 %%[#]Best Neighbor",
                "quest35": "Dear @,^You've been such a help around town since you moved here... everyone keeps telling me all the wonderful things you've done for them! Please accept this thank-you prize. ^   -King%item money 2500 2501 %%[#]Thank-you From King Bozo",
                "quest100": "@,^I am pleased to announce that you've been chosen as \"Neighbor of the year\"! That comes with a 10,000g prize! Congratulations! Everyone in town wants to say 'thanks' for all you've done. ^   -King%item money 10000 10001 %%[#]Neighbor Of The Year",
                "CF_Fish": "Dear @,^ Your angling skills surpass even my ol' Pappy's... I'm impressed. ^ This stardrop's been passed down from Lannery Sr. to Lannery Jr. for... oh, heck. Prob'ly a thousand years.^Seein' as I don't have any kids... I want you to have it.^^ -Lannery Storm  ^  %item id (O)434 1 %%[#]Lannery's Family Heirloom",
                "fertilizers": "Dear neighbor,^I hope you are feeling settled in your new home. I am writing to let you know that Gil's store is now selling fertilizers! Why don't you swing by and see if you can afford a few dozen boxes or so?  ^   -Gil Harmon[#]Gil's Fertilizers",
                "fertilizers2": "Dear @,^I am now selling higher quality fertilizers, as well as new crop selections! See you soon. ^   -Gil Harmon[#]Gil's High Quality Fertilizers",
                "hatter": "Hi.^^Me sell hats. Okay, poke?^^Come to old old old haus, poke. Bring coines.^^-hat mouse[#]Hiyo, Poke",
                "elliottReading": "@,^I have great news... my novel is finished!! I'm giving a public reading this afternoon at the library. Hope to see you there! ^   -Buoy[#]Buoy's Reading",
                "elliottBoat": "Meet me at the docks on a sunny morning. I've got something in mind. ^   -Buoy[#]Buoy's Note",
                "harveyBalloon": "@,^I have a surprise for you. Meet me by the railroad tracks. ^   -PJ[#]PJ's Surprise",
                "samMessage": "@,^meet me in front of my house tonight after dark. ^   -JP[#]JP's Note",
                "joshMessage": "@,^meet me at the Pizzeria tonight after dark. ^   -Alex[#]Alex' Invitation",
                "lewisStatue": "@,^^In the future, I'd appreciate it very much if you refrained from placing my PRIVATE belongings in town for all to see!^^I'm very displeased!^^Take this money and never speak of my 'project' to anyone.%item money 750 751 %%[#]King Bozo' Angry Letter",
                "marnieAutoGrabber": "@,^I've got a new item in stock... It's called the \"Auto-Grabber\".^^This thing can milk your cows and goats, shear your sheep, gather eggs, and pluck your wooly rabbits... all on its own!^^It's considered a 'luxury item', so I'm charging 25,000g.^^    -Oscar[#]Auto-Grabber Notice",
                "EmilyClothingTherapy": "@,^I have this crazy new idea that I want to involve you in... It's called \"Clothing Therapy\".^^Please come to the King's house today to see what it's all about.^^ Love, Emily[#]Emily's Idea",
                "foundLostTools": "Dear @,^Someone dropped your tools into the lost and found bin last night.^^Stop by the King's office to pick them up. ^^  -King Bozo[#]Lost Tools",
                "fishing2": "I've got some new items in stock...^A deluxe fishing pole and some bait that you can attach to it!^You can use bait to make fish bite faster. Hope to see you soon! ^   -Lannery Storm[#]Lannery's New Items",
                "fishing6": "Come by the shop and check out the new rods I'm selling.^They're the best money can buy... and you can customize them with different kinds of tackle!^Hope to see you soon! ^   -Lannery Storm[#]Lannery's New Items #2",
                "wizardJunimoNote": "My sources tell me you've been poking around inside the old community center.^Why don't you pay me a visit?^My spaceship is west of the forest lake. I may have information concerning your... 'rat problem'.^   -Tiny Planet Explorer %item quest 1 true %%[#]Explorer's Summons",
                "winter_18": "Dear @,^I would like to give you some information about an upcoming event: the Feast of the Winter Star. It's a time for the community to come together and think back on all the good fortune we've had this year.^A favorite tradition is the \"secret gift exchange\", where everyone in town is randomly assigned to someone else. On the day of the festival, everyone brings a gift for their secret friend and surprises them with something special!^This year, your secret friend is:^    %secretsanta ^Don't tell anyone! The feast will take place on the 25th from 9AM to 2PM at the town square. See you then! ^   -King Bozo[#]Secret Gift-Giver",
                "ccBulletinThankYou": "Dear @,^Everyone around town has been talking about your great generosity lately!^Apparently, packages have been appearing in people's houses containing items they posted about years ago on the community center bulletin! And the packages are all addressed from your farm!^Thanks for going out of your way to do something like that... all of us in town are delighted! ^   -King Bozo[#]Bulletin Board Thank-you",
                "landslideDone": "To our valued JojaMart customers:^Our team members have removed the landslide caused by our drilling operation near the mountain lake. I'd like to remind you that our drilling operation is entirely legal (pursuant to init. L61091, JojaCo Amendment). Responsible stewardship of the local environment is our top priority! ^^We apologize for any inconvenience this accident may have caused.^As always, we value your continued support and patronage!^^-Fuzzwald,^Joja Customer Satisfaction Representative[#]Joja Removed Landslide",
                "spring_2_1": "Hello there,^Just got back from a fishing trip. You should come down to the beach some time.^I've got something for ya.^-Lannery Storm%item quest 13 true %%[#]Lannery's Invitation",
                "spring_12": "Dear @,^Tomorrow we're holding the Egg Festival in the town square. ^^You should arrive between 9 AM and 2 PM if you'd like to attend.^You wouldn't want to miss the annual egg hunt!^  -King Bozo[#]Egg Festival Notice",
                "spring_23": "Dear @,^Tomorrow we're all getting together for the Flower Dance.^^If you can find a partner, you might even want to participate in the dance yourself!^There's a little clearing beyond the forest west of town where we hold the dance. Arrive between 9 AM and 2 PM if you're interested.^  -King Bozo[#]Flower Dance Notice",
                "summer_10": "Dear @,^Tomorrow we're all gathering at the beach for the annual Pelican Town Luau.^^The highlight of the event is the communal potluck. Make sure you bring something good to contribute!^The governor himself is attending the event, so make sure you're on your best behavior.^Come to the beach sometime between 9 AM and 2 PM.^   -King Bozo[#]Luau Notice",
                "summer_28": "Dear @,^Tonight at around 10 o'clock PM, a rare and beautiful event will take place.^^The moonlight jellies will be passing by Pelican Town on their long journey south for the winter.^^We're all gathering at the beach to watch. You don't want to miss this!^See you tonight,^ -Bababooey[#]Dance Of The Moonlight Jellies",
                "fall_9": "Dear @,^One week from today, we are holding the Stardew Valley Fair in the town square!^It's the biggest event of the year, drawing people from all across the country to our humble town.^If you'd like, you can set up a grange display for the event. Just bring up to 9 items that best showcase your talents. You'll be judged on the quality and diversity of your display.^The fair starts at 9 AM... don't miss it!^   -King Bozo[#]Stardew Valley Fair Notice",
                "fall_15": "Dear @,^I just want to remind you that the Stardew Valley Fair is happening tomorrow.^Don't forget to bring your 9 items for the grange display.^Remember, the fair starts at 9AM in the town square. See you there!^   -King Bozo[#]Stardew Valley Fair Reminder",
                "fall_26": "Dear @,^Notice a chill in the air? It could just be the approach of winter...^Or it could be the tingle of a dark specter, here to help us celebrate tomorrow's festival... the Spirit's Eve.^Come to town at 10 PM if you'd like to participate.^  -King Bozo[#]Spirit's Eve Notice",
                "winter_7": "Dear @,^Tomorrow we're all gathering in front of Oscar's Hotel for the Festival of Ice.^^It's a celebration of winter... there'll be snowmen, ice sculptures, and an ice fishing competition!^Arrive between 9 AM and 2 PM if you'd like to participate.^  -King Bozo[#]Festival Of Ice Notice",
                "winter_14": "Starting tomorrow, a traveling merchant fleet will dock at Pelican Town for the yearly night market.^^The market starts at 5pm, and will be in port for the next three days.^^Please visit the beach after 5pm to join the festivities. There's free coffee![#]Night Market Notice",
                "summer_3_1": "@-^This is embarrassing... I lost my lucky purple shorts. I'm telling you because I think I can trust you.^If you find them, bring them back to me DISCREETLY. I'll pay well.^Thanks.^   -King Bozo%item quest 102 %%[#]King Bozo Asks For A Favor",
                "summer_20_1": "@-^I'm gathering data on the correlation between soil alkalinity and crop fructose levels. Long story short, I need a fresh melon from your farm. If you brought me one I'd be very grateful.^   -Bababooey%item quest 104 %%[#]Bababooey Asks For A Sample",
                "summer_25_1": "To Farmer @:^My knee's acting up again, and you know what helps? ^Rubbing the darn thing with hot pepper.^ Trouble is, my supply's run dry. If you've got one to spare I'd be much obliged.^   -George %item quest 105 %%[#]George Needs A Pepper",
                "fall_3_1": "Dear @,^I'd like to give my cows a special treat. They're such good girls and hungry, too. Could you bring me one bunch of amaranth? They love the stuff. ^Thanks, Dear.^   -Oscar %item quest 106 %%[#]Oscar's Request",
                "fall_8_1": "Hello,^It's blackberry season right now. The bushes are full of them. I want to pick some, but I lost my basket. Can you help?^   -Nintendad%item quest 107 %%[#]Nintendad Lost His Basket",
                "fall_19_1": "@-^I'd like to buy a pumpkin from you. My daughter and I want to carve a jack-o-lantern for the upcoming Spirit's Eve festival. ^   -Jil%item quest 108 %%[#]Jil's Request",
                "winter_2_1": "Hey, I've got a little challenge for you:^    Catch me a squid.^You can fish them from the ocean at night. They only show up in the winter, though.^   -Lannery Storm%item quest 109 %%[#]Lannery's Challenge",
                "winter_6_1": "I've got an unusual request. Could you keep this a secret?^ I want you to deliver an amethyst to Emily. It's her favorite stone. Tell her it's from me.^   -Clunt %item quest 110 %%[#]Clunt's Unusual Request",
                "winter_12_1": "@-^I am researching black holes. I require an item known as 'Void Essence'. Bring it to me and you will be rewarded.^ -The Tiny Planet Explorer %item quest 111 %%[#]Explorer's Request",
                "winter_17_1": "@,^Sorry to bother you again, but I need another favor.^I got a new hammer and I want to try it on a variety of metals.^Could you smelt an iron bar and bring it to me? ^Thanks.^ -Clunt %item quest 112 %%[#]Clunt's Request",
                "winter_26_1": "Dear @-^I want to make fish stew, but I need an albacore! I know they're almost out of season... sorry about the short notice. Could you catch one for me?^   -Bobby%item quest 114 %%[#]Bobby Needs A Certain Fish",
                "spring_1_2": "Notice:^^The price of raw materials at Robin's shop and Clunt's shop has increased.[#]Raw Material Price Notice",
                "spring_21_2": "NOTICE^Gil Harmon here... I really, really want a plate of sashimi. I'll pay top coin to whoever brings me some.^   -Gil Harmon%item quest 117 %%[#]Gil's Craving",
                "summer_6_2": "Fisherman Wanted^I need a good pufferfish specimen. I'm conducting an experiment on the toxin created by the pufferfish.^Reward: 1000g^ -Bababooey%item quest 118 %%[#]Bababooey' Study On Toxins",
                "summer_21_2": "@,^I need truffle oil. Don't ask me why.^ -King Bozo%item quest 120 %%[#]King Bozo' Request",
                "fall_6_2": "Wanted: 1 Fresh Lobster for a marvelous bisque I'm creating.^Who: Bobby, proprietor of the Bobby's Pizzas^Reward: 800g %item quest 121 %%[#]Bobby Needs Lobster",
                "winter_5_2": "@,^I'm creating a new spacecraft.^However, I'm missing something: an Iridium Bar.^I'm willing to pay 5x the market value for it. Bring it as soon as you can.^ -The Tiny Planet Explorer %item quest 123 %%[#]Explorer Needs A Rare Item",
                "winter_13_2": "I've got another challenge for you: Catch me a Lingcod.^They don't go down easy, but I know you can do it.^  -Lannery Storm%item quest 124 %%[#]Lannery's Challenge #2",
                "winter_19_2": "Dear @,^I'm at my wit's end. I desperately want to make a Coco-no-no at the Pizzeria, but I have no way of getting a coconut!^Can you help me?^  -Bobby%item quest 125 %%[#]Bobby Needs A Coconut",
                "winter_24": "Dear @,^Tomorrow is the Feast of the Winter Star.^Did you get a gift for your 'secret friend'... %secretsanta?^The feast starts at 9 AM in the town square. See you then! ^   -King Bozo[#]Feast Of The Winter Star Reminder",
                "passedOut1_Billed_Male": "Dear Mr. @,^Last night, a Joja team member found you incapacitated. A medical team was dispatched to bring you home safely.^We're glad you're okay!^^(You've been billed {0}g for this service)^^-Fuzzwald^Joja Customer Satisfaction Representative[#]Joja Invoice",
                "passedOut1_Billed_Female": "Dear Ms. @,^Last night, a Joja team member found you incapacitated. A medical team was dispatched to bring you home safely.^We're glad you're okay!^^(You've been billed {0}g for this service)^^-Fuzzwald^Joja Customer Satisfaction Representative[#]Joja Invoice",
                "passedOut1_NotBilled_Male": "Dear Mr. @,^Last night, a Joja team member found you incapacitated. A medical team was dispatched to bring you home safely.^We're glad you're okay!^^Since you have no money, we were obligated by law to provide this service free of charge.^^-Fuzzwald^Joja Customer Satisfaction Representative[#]Legally Required Notice",
                "passedOut1_NotBilled_Female": "Dear Ms. @,^Last night, a Joja team member found you incapacitated. A medical team was dispatched to bring you home safely.^We're glad you're okay!^^Since you have no money, we were obligated by law to provide this service free of charge.^^-Fuzzwald^Joja Customer Satisfaction Representative[#]Legally Required Notice",
                "passedOut2": "@, ^You're lucky I found you last night you gabagool! You were unconscious, and someone (definitely not me) was searching your pockets. I have no idea how much money they took... they ran away as soon as I approached. Be more careful!^^-PJ[#]Note From PJ",
                "passedOut3_Billed": "@,^Someone dropped you off at my place last night for some reason. I am your streamer, not your doctor!^You've got to take better care of yourself bozo.^I've billed you {0}g to cover the costs for the green tea I gave you to recover.^^- PJ[#]From the Luckiest gamer",
                "passedOut3_NotBilled": "@,^Dragged you through the mud and into your bed last night..^Since you have no money, this time it will be free of charge.^But next time can I have got the money for this?^^-PJ[#]From the Luckiest gamer",
                "passedOut4": "@, ^^Found you face-down in the mud when I came back from my late-night skull mines dive.^^You should try to make it home a little earlier next time!^^     -PJ[#]Note From PJ",
                "elliottLetter1": "@, my love,^^I've just arrived in Grampleton, to start the tour. I've forgotten how hectic the city is! The streets are packed with people... they either seem in a mad hurry, or lost in a daze, unaware of their surroundings. I miss Pelican Town already!^^I begin the tour this evening, at a local bookstore. I must admit, I'm becoming a bit nervous at the thought of public speaking... my stomach feels as if it's been twisted into a soft pretzel and doused with spicy cheese dip. Wish me luck!^^-Love, Buoy^^P.S. I hope you had a peaceful night, and weren't too scared all alone in that big house! %item conversationTopic ElliottGone2 0 %%[#]Letter From My Husband",
                "elliottLetter2": "My dear @,^^The first reading went well, though the audience was a bit smaller than I'd hoped. Still, I sold enough copies of the book to pay for my (bug-infested) hotel room!^^In a few hours, I leave for Zuzu City. If yesterday's reading was a warm-up, this next one will be a true napalm blast...^^I miss you very much. Remember to eat well! Oh, and don't forget the leftover crab cakes I put in the fridge...^-Love, Buoy %item conversationTopic ElliottGone3 0 %%[#]Letter From My Husband 2",
                "elliottLetter3": "My sweet @,^^Last night in Zuzu City was quite the experience! It seems there's a large literary scene here... a few dozen people showed up at my reading!^^I even signed a couple of autographs... it's strange to be seen as someone important. It's all a matter of framing, a grand illusion... for truly I am no one special. Only your devoted Buoy, as always.^^Currently I'm alone, in my hotel room, 'ingesting' a Joja Value Meal...^^Should this be called 'food'?^Or 'edible matter'?^I needn't long brood^It must be the latter^^I look forward to returning home soon. Hope you enjoyed the crab cakes.^^-Love, Buoy %item conversationTopic ElliottGone4 0 %%[#]Letter From My Husband 3",
                "elliottLetter4": "In dreams, when graced with lofty view^I gaze upon the sunlit sea^What distant shores I've traveled to^But time now clouds my memory^^There is but one eternal place^Where I shall someday pass beyond^In Valley dear, where my love waits:^Our little home beside the pond^^-Buoy %item conversationTopic ElliottGone5 0 %%[#]Letter From My Husband 4",
                "elliottLetter5": "My dear @,^^I won't bore you with any more details about my readings. They are mostly the same.^^I'm sure your time has been much more exciting! I can't wait to return and see what progress has been made.^^On these long travels between towns, I amuse myself by closing my eyes and envisioning the farm... I see kegs pulsing with sweet wine, a furnace ablaze with precious ore, and our little kitchen with the smell of cinnamon and nutmeg. There's a lot to enjoy!^^Just don't stay out too late in the mines, my love. It's dangerous in there! If you must go... bring plenty of food.^^-Love, Buoy %item conversationTopic ElliottGone6 0 %%[#]Letter From My Husband 5",
                "elliottLetter6": "My dear @,^^This will be my last letter before I return home. I've had a fine trip... though nothing too exciting. It's been nice to meet people who enjoy my work, but I'm eager to return home.^^I look forward to the comfort of our little house, the satisfying farm work, a home-cooked meal, and most of all, cozying into the flannel sheets with you.^^See you soon!^-Love, Buoy %item conversationTopic ElliottGone7 0 %%[#]Letter From My Husband 6",
                "CarolineTea": "Dear @,^^Thanks for stopping by my sunroom yesterday. I usually drink tea alone, but it was fun to share with you!^^I've enclosed instructions on how to prepare and grow your own tea. No pressure, but if you do end up growing some, make sure to bring me a cup!^^-Jil%item craftingRecipe Tea_Sapling %%[#]Jil's Tea Note",
                "willyBackRoomInvitation": "@,^^I've unlocked the back room of the shop.^Come by when you have a chance.^There's something I want to show you.^^-Lannery Storm[#]Lannery's Back Room Invitation",
                "KrobusCrafting": "@, I'm not sure how the human message system works, so I asked Explorer to help me write this letter.^^I hope you are doing okay.^^I wanted to share this with you... it's notes on how my people build a certain item.^^   -Sad Ghost%item craftingRecipe Dark_Sign %%[#]A letter from Sad Ghost",
                "ClintReward": "Um, Hello...     ^Thanks for helping me clear out those monsters.^^I'm not scared at all! ...But it should make the mines safer for everyone else... right?^^Take this blueprint. (Hope it doesn't make me obsolete...)^^   -Clunt, the blacksmith%item craftingRecipe Geode_Crusher %%[#]Clunt's Thank-you",
                "ClintReward2": "Um, Hello...     ^Thanks for helping me clear out more monsters.^^Maybe next time, I'll take care of them myself... if I have time!^^Take this item. I found it in the back room...^^   -Clunt, the blacksmith%item id (O)286 10 (O)287 5 (O)231 3 %%[#]Clunt's Alternate Thank-you",
                "willyBugWadCutscene": "^^   -Lannery Storm%item craftingRecipe Quality_Bobber %%[#]Lannery's Thank-you",
                "MSB_Pierre": "Dear @,^^I guess people didn't take to 'Gil's Prime Produce' like I'd hoped...^^Anyways, here's my old 'Mini-Shipping Bin'.^The next time you get your hands on some produce worthy of the 'Gil's Prime' luxury brand, maybe you could have them shipped my way?^^   -Gil Harmon%item id (BC)248 %%[#]Gil's Prime Produce",
                "MSB_Lewis": "@,^I wanted to thank you for taking care of my special order. All of the hard work you've done has been a great boost to Pelican Town's image.^Here's a 'Mini-Shipping Bin' as a token of my appreciation.^Place it anywhere and I'll be sure to make a stop when I make my rounds.^^   -King Bozo%item id (BC)248 %%[#]King Bozo's Thank You",
                "WizardReward": "The specimen you delivered offered great insight into the machinations of the fell beings we call 'monsters'.^^I've formulated a pungent tincture that these beings find intoxicating. Use it with caution...^^   -Tiny Planet Explorer%item craftingRecipe Monster_Musk %%[#]The Explorer's Discovery",
                "WizardReward2": "Thanks to the ectoplasm you delivered to me, I've made a major breakthrough in the field of arcane engineering.^^Enclosed, you'll find blueprints for a most useful machine...^^   -Tiny Planet Explorer%item craftingRecipe Mini-Obelisk %%[#]The Explorer's Breakthrough",
                "DemetriusReward": "Hi @,^^Thanks for your help with the fish.^Nature is usually good at keeping things balanced, but sometimes artificial factors can cause an imbalance.^^I've enclosed a blueprint from a science magazine that you might find interesting.^^-Bababooey%item craftingRecipe Farm_Computer %%[#]Bababooey' Thank You",
                "willyHours": "Good news!^^The ol' boat is seaworthy once again, thanks to you!^^Stop by the back room whenever you want a ride.^^My shop is now open at 8AM every day, so you can get an early start.^^-Lannery Storm[#]Lannery's Boat",
                "linusTrashCleanup": "Hi @,^^Thanks for helping me clean up around the valley.^The waters are looking much cleaner. I think everyone will appreciate it. I know I will.^As a way of saying 'thanks', I wanted to teach you how to grow your own fiber. I hope it's useful.^^-Nintendad%item craftingRecipe Fiber_Seeds %%[#]Nintendad' Thank You",
                "gusGiantOmelet": "Hi @,^^Thanks for the eggs.^The yolks look amazing... I think this will be my best omelet yet!^^Please accept this gift.^^-Bobby%item id (BC)216 %%[#]Bobby' Famous Omelet",
                "carolineSO": "Hi @,^^King Bozo told me that you've been shipping a lot of ingredients from the island! It's great to have access to new produce... it really opens a whole new world of culinary possibilities!^I'm including a gift for you... some blueprints you might find useful.^^-Jil%item craftingRecipe Solar_Panel %%[#]Jil's Tropical Ingredients",
                "WillyTropicalFish": "@,^^Congrats on a successful island fishing trip. I'm proud of ya!^^Here, take this special fish tank. It'll make a great piece in your house.^^-Lannery Storm%item id (F)2312 %%[#]Lannery's Tropical Challenge",
                "passedOutIsland": "@,^^You never showed up at the boat, so I went lookin' for ya.^^Found you sprawled out in the dirt, with a couple o' parrots pulling gold out of your pockets!^^Had to drag you all the way down to the boat. Me legs feel like two freshwater shrimp...^-Lannery Storm",
                "passedOutIsland_Leo": "Hi @,^^Last night, I found you slumbering in the dark.^It wasn't a very safe place, so the bird friends air-lifted you to your bed.^Please be careful from now on.^^-Leo^^P.S. Lannery helped me write this.",
                "LeoCooking": "@,^Here's a food from my home, that me and my family enjoy. Hope you like it. ^^  -Leo^^P.S. Lannery helped me write this.%item cookingRecipe %%[#]Leo's Recipe"
            }
        }
    ]
}