{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Strings/SpeechBubbles",
      "Entries": {
        "SeedShop_Pierre_Winter": "Hi there!",
        "SeedShop_Pierre_NotWinter": "Hi there! Welcome to the Sweet Potato Mart!",
        "SeedShop_Pierre_Summer": "Summer seeds available!",
        "SeedShop_Pierre_NotSummer": "Seeds for sale!",
        "SeedShop_Pierre_Greeting1": "Hello there!",
        "SeedShop_Pierre_Greeting2": "It's farmer {0}!",
        "SeedShop_Pierre_Raining": "It's a good day to shop!",
        "SeedShop_Pierre_NotRaining": "Welcome!",
        "SeedShop_Pierre_RareGreeting": "Did you remember your wallet"
      }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Pierre",
      "Entries": {
        "Introduction": "Hello there! I'm Gil Harmon, owner of the Sweet Potato Mart..#$b#Stop by if you're ever looking for seeds, I'm always home#$e#I'm also very good at advertising, if you need that sort of thing!",
        "Resort": "I'm losing a lot of money being away from the shop...$s#$b#But I have to take advantage of house arrest leave when I can!",
        "Resort_Shore": "When I'm free for good, I want to live here.",
        "Resort_Chair": "Eh, let the kids play in the sun. I'll just sit in this chair.",
        "Resort_Bar": "Drink after drink... Bobby must be making a killing!",
        "cc_Complete": "This is a dream-come-true! You can't begin to imagine how much stress JojaMart was causing me.#$e#For a small town like this, one store is enough!",
        "joja_Begin": "This is a sad day for Pelican Town... The stronger Joja becomes, the closer I move toward bankruptcy. I might have to sell the shop soon...$s",
        "MovieInvitation": "Hey, that's a great idea... I will have to appeal for leave first. I can't go back to jail",
        "Mon": "Do you need help with something? Don't fear because Gil Harmon is here!",
        "Mon_inlaw_Abigail": "Hello, er... my son?$s^Hello, er... daughter?$s",
        "Mon4": "Hi, @. Need help from the super techster? Oh this ankle ‘bracelet'? Don't you worry about that…",
        "Mon4_inlaw_Abigail": "Hi, @. How's Abigail doing? The shop hasn't been the same without her...",
        "Tue": "If you need my tech help just let me know! I'm a super techster!.#$e#Wait… should I put that on a t-shirt?$h",
        "Tue6": "Jil was very kind to let me stay here after the divorce…$h",
        "Wed": "It's my day off today.#$e#If only I wasn't on house arrest…$s",
        "Wed4": "I have a new very exciting thing to sell you! The guy I bought it from said it would be the next big thing! Wait, where are you going?.$s",
        "Thu": "I'm happy to buy any produce off you.#$b#I'll give you a fair price - that's a Gil Guarantee!",
        "Thu2": "I really do appreciate your business, Mr. @. It's been hard for business since I was put on house arrest^I really do appreciate your business, Ms. @.It's been hard for business since I was put on house arrest",
        "Thu8": "#$1 pierre2#Does Abigail look anything like me? Don't tell my ex-wife, but sometimes I wonder if I'm really the father.$k$s#$e#Don't tell my ex-wife, but I hate to cook dinner.",
        "Fri": "#$1 pierreJoja#Business has been slow since Joja moved into town. It's hard to compete with their selection.$k$s#$e#Hi there. Is your farm doing well?#$e#Maybe a few of my these seeds will spruce things up!",
        "Sat": "If you find any wild produce, I'll take it off your hands for a reasonable price - that's a Gil Guarantee!",
        "Sat8": "I'll tell you a secret. I'm on house arrest for tax fraud.$h#$e#Oh, you already knew?.",
        "Sun": "#$1 pierreBlue#*sigh*... I've got those behind-the-counter blues...$k$s#$e#I wish I could go for a walk, but I don't want to go back to jail.#$e#I've heard the flowers are in bloom and the air smells great...$s",
        "Wed6": "#$1 pierre1#*sigh*... No matter how well the business does, it's never enough to satisfy my desire for success. $s#$e#Someday I'm going to open a new shop in the city and make a killing.#$e#Unfortunately, I lost all my money in the divorce...$s",
        "Thu4": "Hey, @. You're my number one customer!",
        "summer_Mon": "I've got summer seeds available! You'd better stock up.",
        "summer_Wed": "I'm so glad to have a day off from work.",
        "summer_Thu": "Everyone's enjoying the weather instead of shopping... *sigh*",
        "summer_Fri": "Hi there! Are you satisfied with the quality of my summer seeds?",
        "summer_Sat": "Summer is a good time to eat a refreshing salad, don't you think? Try my new range of Salad Veggies™, order today!",
        "summer_Sun": "Ugh... It's so hot in here.",
        "winter_Mon": "You can't grow any crops during winter... so I have no seeds to offer you.#$e#It's really going to cut into our profits.",
        "winter_Wed": "#$1 pierreDin#My ex-wife and I are actually good friends$k#$e#She let me stay here after the divorce.",
        "winter_Thu": "Hello there! In the mood for a little shopping?",
        "winter_Fri": "Hello there! I'm Gil Harmon, and this is Winter Toeless Shoes! - What do you think? Do I still need to work on my sales pitch?.",
        "winter_Sat": "Is it just me or is there a cold draft in here?",
        "winter_Sun": "If I wasn't on house arrest, I would be outside right now.#$e#It would be fun to throw a snowball.",
        "fall_Mon": "Fall seeds are here! Crops don't grow in winter so this is your last shot until spring.#$b#Better go all out, huh?",
        "fall_Thu": "It's starting to get cold outside...#$b#That means more people come into the shop to warm up... hehe.",
        "fall_Fri": "#$1 pierreMEGA#My dream is to keep opening new stores until I become extremely wealthy. hehehe.$k#$e#Hi there. Is your farm still doing well?#$e#Maybe a few of my seeds will spruce things up.$h",
        "fall_Sat": "I'm happy to buy whatever you produce on the farm.#$e#Yes, I do resell it for a profit... but that's the benefit of being an established shop owner.#$e#Don't get any ideas...",
        "fall_Sun": "If I wasn't on house arrest I would be outside right now...#$e#The leaves look great and the mushrooms are sprouting.",
        "Event_naga1": "Thanks, I appreciate that. Just forget you ever saw this, okay?$h#$b#...And I'll just forget that you were snooping around in my bedroom!",
        "Event_naga2": "You would really do that to me? You're terrible.$s#$b#You shouldn't have been snooping around in my bedroom in the first place! Nosy neighbours are the worst.$3"
      }
    }
  ]
}