{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Marnie",
      "Entries": {
        "Introduction": "Ah, King Bozo told me you just arrived. I'm Oscar!#$e#I run the hotel and just expanded into selling livestock and animal care products . You should swing by some time.$h",
        "Resort": "Hehe... finally a chance to show off all my hard work at aerobics club.$h",
        "Resort_Leaving": "I feel warm.",
        "Resort_Shore": "It’s nice to be the one on holiday for once",
        "Resort_Chair": "We should get one of these for the hotel",
        "Resort_Bar": "Phew... It's hot!$s",
        "reject_789": "Gah!$4#$b#...Um... What? Heh.. I don't know what that is...$3",
        "Mon": "I love animals, Mr. @. That’s why I thought they would be fun to sell at the hotel!^I just love animals, Ms. @. hat’s why I thought they would be fun to sell at the hotel!",
        "Mon4": "If you need anything, just ask Oliver.?$s#$e# He’s my assistant.$s",
        "Thu_2": "You've been here a while, now... how's your farm doing?#$e#If you need some rest at the hotel, just let me know!$h",
        "Saloon": "Now that I'm here I can finally relax and socialize a bit.",
        "Saloon_Tue": "There aren't very many people here today...$s",
        "Saloon_Wed": "#$1 marnieAnimalSal#A guest accidentally opened a rift in time and space today, but we got that sorted out$k$s#$e#It's nice of you to show up! It's a little more lively now.",
        "Saloon_Thu": "Phew! It sure feels good to kick back after a hard day's work.",
        "Saloon_Fri": "%Oscar is discussing something very important with King Bozo and doesn’t want to be disturbed",
        "Saloon_Sun": "Sunday is the busiest day of the week at the hotel.",
        "Saloon_Sat": "I always see Clunt here but he won't talk to anyone. What an ass.$s",
        "Tue": "Wiggles has been staying at the hotel the last few months.#$e#",
        "Wed": "You can use a scythe to cut feed from grass.#$e#Or you can buy it from me, of course!$h#$e#It’s a side business for me...$u#$e#Goodbye",
        "Thu": "Hi. Need something?#$e#I can get a room ready for you, or maybe you would like to buy some animals?.#$e#A guest left a lot of them here, so I’m trying to find them new homes.",
        "Fri": "You can catch me at the saloon most nights.#$e#I need to relax after helping guests all day.",
        "Fri4": "#$1 marnieLike#I think someone in town has taken a liking to me. $k$h#$e#I wouldn’t know what to do without Olivert.",
        "Fri6": "I wonder if King Bozo gets lonely in that big house of his... $s#$e#It seems so empty in there, doesn't it?",
        "Sat": "Have you been to see the tiny planet explorer?#$e# Their rocket crashed here a few years ago.$s#$e# they would still rather live in that pile of junk than stay here for some reason….",
        "Sun": "Hey there, it's good to see ya!#$e#Feel free to visit us any time you please.",
        "Sun8": "Hi @!$h#$e#I'm glad we've become friends."
      }
    }
  ]
}