{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Strings/Schedules/Harvey",
      "Entries": {
        "Mon.000": "This chat is turning my brain into slop $4", 
        "Wed.000": "Madness? Welcome to Sparta! $s", 
        "Wed.001": "Oh God, I think I just prismatic sharded myself",
        "Fri.000": "Today there will be no more zamns, no more tomfoolery. Just good clean fun.$s", 
        "Fri.001": "I've been in my cringe era for as long as I can remember$2",
        "Fri.002": "I am the best gamer in this room right now. $h",
        "Sat.000": "Sex is illegal in the eyes of god.$s", 
        "winter_15.000": "I'm not sharing my soup with anyone$2"
      }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Harvey",
      "Entries": {
        "Introduction": "It's a pleasure to meet you. I'm PJ.#$b# Yes, Painful Jesus is what the PJ stands for. #$e# See, there's ten things you should know about me, I don't want to know anything.$h",
        "Resort_Entering": "I've always wondered, can you actually drink the milk from a cactus?",
        "Resort_Leaving": "I don't need any more socializing, I need hot dogs",
        "Resort_Shore": "Oh God, I think I just prismatic sharded myself",
        "Resort_Chair": "It's nice to have an opportunity to relax now and then.#$b#The trouble is actually letting go of your worries...$s",
        "Resort_Bar": "A word of advice from ol' kickie PJ, don't drink candle wax.$h",
        "Resort": "I'll let you in on a little secret...I caused global warming$s",
        "danceRejection": "Sex is illegal in the eyes of god.$s",
        "5_1": "No one lies around me, I'm the only liar around here! #$e#No, I just love lying",
        "Mon": "It's not about the journey, it's about the destination. #$e#No, reverse that. It's about the destination, it's not about the journey.$6 #$e#That's exactly the same thing I just said but different. $4",
        "Mon2": "3, 2, 1, fuck it.$2",
        "Mon6": "I just love being a cheeky little troll hehe $2",
        "Mon10": "I'm trying to say something wise, but I'm not entirely sure what I'm trying to say.. $6",
        "Tue": "Anything can be badonked. $3#$b#For instance, I just badonked my cat..$6",
        "Tue8": "I'm not saying that you can't be hot and catch fish. $2",
        "Wed4": "I think for the right price I could be bribed $2",
        "Wed6": "If I can scare one kid a day that personally helps me sleep better. $3",
        "Wed8": "Do I look like someone who needs a sword? I fight with my mind!$h",
        "Wed": "I know plenty more about this game than you do, sweaty.",
        "Thu8": "My badinky likes that.$2",
        "Thu": "I have prismatic shards flying out my ass $5 #$e# Oh God, I think I prismatic sharded myself. $4",
        "Fri": "One roast from me and you'll quit the internet $2",
        "Fri4": "One time, I saw Twilight by myself accidentally. $4",
        "Fri10": "Okay so now the silly stuff begins",
        "Sat": "I have a very important question for you, @. If you saw a hole in a cave, would you jump into it?",
        "Sat4": "Oh, hey @. Please don't laugh at my tiny bobber.$6",
        "Sat8": "You're only as old as you feel, and I feel like a newborn baby.$h",
        "Sun": "Lannery is not getting his hands on my catfish... #$e# @ do you think he would have given me more money if I had given him my big eel?",
        "Sun6": "You've just experienced a fish ON moment. $2",
        "event_george1": "Thanks, @.$h#$b#You see, George, I'm just trying to help you.",
        "event_george2": "*Sigh*$s#$b#Look, George. If you want to behave like this I'm going to have to tell your wife. I don't think she'll be happy.",
        "event_aerobics1": "Thanks, @. I appreciate that.$h",
        "event_aerobics2": "*Sigh*... rude.$s",
        "event_heart1": "Oh! Cameras make you nervous, huh?#$b#Just try and relax. I'm here to help.$h",
        "event_heart2": "Okay. That makes sense.",
        "event_heart3": "Um. Okay... If you say so.$s",
        "event_grave1": "...You're right.#$b#...Thanks.",
        "event_grave2": "*sigh*$s",
        "summer_Mon": "Millions of gamers suffer every year.",
        "summer_Thu": "I know it's tragic but sometimes you've got to send an egg to jail.$6 #$e#I just brought down the hammer of justice on an egg. $3",
        "summer_Fri": "Maybe I should get a fedora..",
        "fall_Fri": "if someone ever gives you the ick, just give it straight back to them.",
        "fall_Sat": "You guys think you can read me like a book.$4 #$e#I  I think it's time to go back to the library, motherfuckers $2",
        "winter_Wed": "You can't see it but I'm shaking my butt.",
        "winter_Sun": "I'm not gonna build a coop, I'm gonna build a horse!#$e# Actually wait… what is a horse? $6"
      }
    }
  ]
}