{
  "Changes": [
    {
      "Action": "EditData",
      "Target": "Strings/Schedule/Willy",
      "Entries": {
        "Fri.000": "Handling salty fish all day makes me real thirsty.",
        "spring_9.001": "Eh, I got a fish hook stuck in my thumb... maybe I find something in the shop that helps removing it.",
        "winter_17.000": "Ah, nothin' like a hot beverage to wind down after a cold, dark day… and what a dark day it was.",
        "spring_9.000": "I have an appointment with a salty fella today, so if you need to buy anything you'd better hurry.",
        "spring_9.003": "I need a little warm-me-up to be ready for another cold night on the ocean.$h",
        "Sat.000": "Ah... Nothing's better than kicking back with a cold one after a successful day on the ocean.$h",
        "winter_15.000": "I can't get me a good night's sleep with that night market going on... eh, but that's okay. Maybe there are some sketchy people around.",
        "winter.000": "I need a little warm-me-up to be ready for another cold night out on the ocean.$h",
        "winter_16.000": "Have you been on the deep-sea submarine? The captain's an old friend."
      }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/Willy",
      "Entries": {
        "Potat_Crash": "I heard the crash all the way from my boat!",
        "Introduction": "Ahoy there! It's nice to see young folk movin' to the valley. It's not very common these days.",
        "accept_869": "Ah... That's the perrrrfect bait for a catfish I've been tryin' to catch!#$b#Here, let me trade you this for it. I'm not sure what it is, but it washed up on the beach not too long ago.#$b#Somethin' tells me you could use it, lad.^Somethin' tells me you could use it, miss.",
        "FullCrabPond": "*sniff*... Ah... That old familiar scent. You've been raisin' crabs, haven't ya?#$b#Yer a man after me own heart, @. Hah!$h^Yer a lady after me own heart, @. Hah!$h#$b#Here, take this. I found it on the beach... Been savin' it fer a special occasion. It's not every day I discover a fellow crab enthusiast! [797]",
        "MovieInvitation": "Ah... a movie. That's kind of ye, lad.^Ah... a movie. That's kind of ye, miss.#$b#I'll just finish up around here, and head over.",
        "Mon": "Ahoy there, son.^Ahoy there, lass.#$b#Looks like decent weather for fishing, eh?",
        "Mon4": "Have you had much luck in the local waters? You look like you could be a strong angler if you set your mind to it.",
        "Tue": "A true angler has respect for the water... don't you forget that. Respect the SEA!",
        "Tue6": "The ol' Man was a fisherman, you know. I grew up sailing between the fern islands, living from catch to catch.#$e#The life at sea is tough, but there's something about it that keeps you goin'.",
        "Wed": "Some fish come and go with the seasons. Others only come out at night or in the rain.",
        "Thu": "*mumble* *mumble* ...Eh? I would tell you about my thoughts, but I'm thinking about my late wife.",
        "Thu2": "There's rumors of some very rare fish in these parts... but only an experienced angler could stand a chance against them.#$e#You'll need the finest bait you can get if you want a rare fish to bite.",
        "Fri": "If you really want to get the fish biting, make sure you put some bait on your hook.",
        "Sat": "Did you met Buoy yet?#$e#I found him lost in the sea and adopted him. A lovely lad.",
        "Sat8": "How's the fishing life going for ya?#$e#I try to fish as often as possible, but it's not easy when you've got a shop to run.",
        "Sun": "If you purchase a high quality fishing rod, you'll be able to attach bait and tackle to the line.#$b#Bait causes fish to bite faster. Tackle can make your job a lot easier when reeling fish in.#$e#There's all kinds of tackle, with different perks. They're usually a little flimsy, so don't be surprised if your tackle breaks after a while.",
        "Sun10": "Hey, it's my skipper, @!$h#$e#I'd give you a discount on bait if I could afford it.$s"
      }
    }
  ]
}