{
    "Changes": [
        {
            "Action": "EditData",
            "Target": "Strings/SpeechBubbles",
            "Entries": {
                "SeedShop_Pierre_Winter": "Hi there!",
                "SeedShop_Pierre_NotWinter": "Hi there! Welcome to the Sweet Potato Mart!",
                "SeedShop_Pierre_Summer": "Summer seeds available!",
                "SeedShop_Pierre_NotSummer": "Seeds for sale!",
                "SeedShop_Pierre_Greeting1": "Hello there!",
                "SeedShop_Pierre_Greeting2": "It's farmer {0}!",
                "SeedShop_Pierre_Raining": "It's a good day to shop!",
                "SeedShop_Pierre_NotRaining": "Welcome!",
                "SeedShop_Pierre_RareGreeting": "Did you remember your wallet",
                "AnimalShop_Marnie_Greeting1": "Welcome to Oscar's Hotel!",
                "AnimalShop_Marnie_Greeting2": "Hello there!",
                "AnimalShop_Marnie_CloseFriends": "Hi, {0}",
                "AnimalShop_Marnie_NotCloseFriends": "Looking for a room?",
                "AnimalShop_Marnie_Raining": "Wipe your feet!",
                "AnimalShop_Marnie_NotRaining": "Welcome to Oscar's Hotel!",
                "AnimalShop_Marnie_Greeting3": "Hey! How's {1} Farm doin'?",
                "AnimalShop_Marnie_RareGreeting": "Gotta get that cleaned up…",
                "Hospital_Maru_Greeting1": "Welcome to the KickthePJ store!",
                "Hospital_Maru_Greeting2": "Can I help you?",
                "Hospital_Maru_Greeting3": "We've got art for sale!",
                "Hospital_Maru_Greeting4": "Are you looking for PJ?",
                "Hospital_Maru_Greeting5": "Here to buy some cool art?",
                "Hospital_Maru_Spouse": "Hi, honey",
                "Saloon_Gus_Greeting": "Come in, come in!",
                "Saloon_Gus_Summer": "Need a cold drink?",
                "Saloon_Gus_NotSummer": "What can I get for ya?",
                "Saloon_Gus_Snowing1": "It's cold outside but the pizza's hot!",
                "Saloon_Gus_NotSnowing1": "Need a hot meal?",
                "Saloon_Gus_Raining": "Have some fucking pizza!",
                "Saloon_Gus_NotRaining": "Bobby baby bobby bubbi",
                "Saloon_Gus_Snowing2": "Come in out of the cold!",
                "Saloon_Gus_NotSnowing2": "Welcome!",
                "Saloon_Gus_RareGreeting": "You look like you need a pizza."
            }
        },
        {
            "Action": "EditData",
            "Target": "Strings/AnimationDescriptions",
            "Entries": {
                "abigail_videogames": "Urghh... I still can't beat the first level of 'Journey of the Prairie King'!$u",
                "harvey_radio": "%PJ looks busy right now.",
                "harvey_examine_left": "Now what kind of advice do you need?$u",
                "alex_lift_weights": "Unghh... Can't talk.",
                "demetrius_dance": "%Bababooey  is busy.",
                "demetrius_read": "I will kill you in the…",
                "marnie_exercise": "%Oscar smiles at you through a mist of sweat.",
                "vincent_read_right": "Ms. Penny says I have to read this book before I can go play.$s",
                "penny_wave_left": "This town's safe, but I always walk home with Vincent and Oliver anyway.",
                "sam_guitar": "%JP is busy practising the guitar.",
                "sam_gameboy": "One sec... I gotta beat this level.$7",
                "sam_skateboarding": "%JP's trying to do a kickflip.",
                "sam_pool": "$c .5#Hmm... If I give the cue ball a bit of a top spin, maybe I could...$7#$e#*Sigh*... I'm not very good.$s",
                "sam_work": "%JP's on the clock... better not get him in trouble."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Pam",
            "Entries": {
                "Resort": "Heh... Lannery gave us each a piece of his fish jerky on the ride over. Delicious!",
                "Saloon_Entry": "Ah... Finally./I need a drink./Bobby! Gimme the usual./Hey, I'm back!/Ooh boy, am I thirsty!/I'm parched!",
                "Trailer_Entry": "Penny! Did you make dinner?/Penny! You done your chores?/Penny! You home?/Hey! I'm home!",
                "Saloon6": "Hey, kid. I'd buy you a drink if I could afford it!",
                "Saloon_Tue": "Hey Bobby! Gimme another round! *hic*$h",
                "Saloon_Fri": "Oi, Bobby! Gimme another pint of your strongest!",
                "Thu": "#$1 PamDrunk#Blahh... I had one too many caramel porters at the restaurant last night... Go away.$k#$e#My house ain't pretty but at least it's by the river.#$e#Hey. Penny's my baby girl. Be nice to her or leave her alone, got it?",
                "Thu4": "Penny says I spend too much time at the pizzeria...$s",
                "Fri2": "You know, I've been thinking... I wish I had a hobby. Something to do other than hanging around at that pizzeria every night.#$e#You got any ideas?#$e#...Ehh. Maybe I'll play checkers against myself.",
                "Sun": "Are you friends with Bobby? He's a pretty good guy.#$e#He even gives me free beer on my birthday.",
                "summer_Thu4": "I always seem to end up at the pizzeria at some point.#$e#It's too close to my house. It ain't healthy.",
                "winter_Thu": "It's awful cold. A visit to the restaurant should warm me up, don't you think? Heh heh.#$e#Why don't you swing by the restaurant later for a taste o' the Oh-Be-Joyful?"
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Robin",
            "Entries": {
                "Sun": "I hope Bababooey doesn't get hurt on one of his adventures.#$e#I'm not even sure where he is going or what he has to fight but it sure sounds dangerous.",
                "Sun2": "#$1 RobinDem#My husband almost set the house on fire last night with his science experiment. One of his beakers exploded and sent a fireball into the rafters! Thank Yoba I used fire-resistant lacquer when I built the place.$u#$e#Sorry if it smells weird in here, @. It's my husband's bizarre project...",
                "fall_Mon": "#$1 RobinMaru#Paul likes gems. He uses them in his inventions.#$e#So how are you and Paul getting along?",
                "fall_Fri": "Have you met the wild man that lives behind our house?$s#$e#I feel like I recognize him from somewhere..."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Penny",
            "Entries": {
                "Tue": "I'm tutoring Vincent with Oliver's help today... Vincent is a handful, but it's nice to make a difference in someone's life.",
                "Wed": "We don't have a school here but I'm doing my best to give Vincent a proper education.#$e#Every child deserves a chance to be successful.#$e#Oliver helps out where he can. Vincent is good at... well, he has an active imagination!",
                "Wed2": "You know what? I should take Vincent and maybe Oliver on a field trip some time. Maybe to the forest.#$e#A guest speaker would be nice... maybe someone familiar with nature?#$e#Sorry, I'm just thinking out loud.",
                "Sat2": "$d Joja#Things changed a lot after the JojaMart went up. It's been really bad for Gil's shop. Mom loves JojaMart, though. The prices are cheap, so she can afford a lot more there than she ever could at Gil's.|Mom's been complaining ever since JojaMart closed down. I think it's good for her, though. Maybe she'll drink less Joja Cola now.",
                "winter_Fri2": "Are you friends with Nintendad? He lives in a tent up in the mountains.#$e#Everyone ignores him, the poor guy. He's actually really nice... Just a little odd.#$e#It must be so cold to live in a tent this time of year."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Kent",
            "Entries": {
                "Thu6": "#$1 Kent1#I've been up since 4 o'clock... sometimes I wonder if I'll ever get back into a normal routine.$k#$e#JP has really grown up since I left. He's a man now.#$e#I wish I could've been there for him.$s"
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Jodi",
            "Entries": {
                "Resort_Bar": "We all love it when Bobby shows up.",
                "Thu6": "Where does all the time go? *sigh*#$e#I remember when JP was a little baby wearing diapers. He was such a cute little kid and had so much fun with his cousin PJ back then.$s#$e#Don't tell him I said that.$h#$e#You must really like talking to me, huh?",
                "Fri": "$d Joja#The food at JojaMart might not be the healthiest for my family, but with such low prices you'd be crazy to shop anywhere else!|The food at Gil's is so much fresher and healthier than anything I ever bought at JojaMart. I do miss those cheap Joja prices, though.",
                "Sun8": "I had a dream that I had complete freedom, no obligation to anyone but myself...#$b#...Then I woke up and realized I had a full day of house chores ahead of me...$s#$e#But I don't regret having a family, @... JP and Vincent mean everything to me!",
                "summer_Tue_inlaw_Sam": "How's my little JP doing on the old farm?$h",
                "fall_Thu_inlaw_Sam": "Is JP just bumming around the farm, or is he contributing?",
                "fall_Sun": "Jil and I are good friends. I tell her everything.",
                "winter_Thu": "JP makes a lot of noise with that music of his. I hope it doesn't disturb the neighbors.",
                "winter_Thu_inlaw_Sam": "How's JP doing? I have to admit, there's less cooking and cleaning to do since he moved out..."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Evelyn",
            "Entries": {
                "Wed": "#$1 evelynGarden1#I saw the most beautiful family of butterflies sunning themselves in the town garden yesterday.$k#$e#King Bozo put me in charge of the town's public gardens.#$e#I've been working on the town flower beds for weeks, so don't step on them!",
                "summer_Wed": "King Bozo put me in charge of the town's public gardens.#$e#I've been working on the town flower beds for months, so don't step on them!",
                "fall_Wed": "King Bozo put me in charge of the town's public gardens.#$e#The fall flowers are delicate, so don't go stomping on them! I know how you kids like to do.",
                "fall_Sat": "Are you friends with Buff Buoy?#$e#Sometime he worries me sick."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/George",
            "Entries": {
                "Introduction": "Hmmph... It's irritating to have to meet all these new people, huh?#$b#Name's George, by the way. Now fuck off... Hmmph.",
                "Wed": "Buff Buoy is my grandson. Have I told you that already?#$e#Huh? Speak up.",
                "Wed_inlaw_Alex": "Never have I expected to see Buff buoy so happy. Welcome to the family!^You're part of the family, now. I'm glad that my grandson found such a nice wife.",
                "Wed8": "I wish my legs worked so I could play catch with Buff Buoy.$s#$e#That'll never happen.$s"
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Sebastian",
            "Entries": {
                "Resort_Shore": "You think Lannery would let me lug a jet ski out here?#$b#...Nah.$h",
                "Wed2": "JP is probably my only friend in this town.#$e#Well, Abby is nice too, but...$h#$e#Umm.. nevermind.",
                "Wed2_inlaw_Abigail": "JP is probably my only friend in this town, anymore...",
                "Wed6": "You and JP are probably my only friends in this town.$s",
                "Thu4": "Why does everyone like Paul so much? Sure, he's smart and friendly, but don't they realise it's all just an attention-grabbing scam?#$e#Sorry...$s",
                "Fri8": "What's new?$h#$e#I'll be at the pizzeria tonight destroying JP at pool again.$h",
                "winter_Sun": "I built a snowgoon but Bababooey made me get rid of it.#$e#What's his problem?$u",
                "winter_Sun6": "I built a snowgoon but Bababooey made me get rid of it... yet Paul's cute little snowman goes unharmed!$a#$e#Ridiculous."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Leah",
            "Entries": {
                "Resort_Wander": "Mmm, I bet the trees around here would make for an interesting medium to work with.#$e#Though Lannery probably wouldn't be happy with me if I dragged a bunch of logs onto his ship!$h"
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Haley",
            "Entries": {
                "Potat_Crash": "I hope my pictures of the giant sweet potato go viral! $h",
                "Resort_Bar": "Bobby made a cute, fruity drink just for me!$h",
                "Event_room1": "Him? No!#$b#...Well, I guess I used to like Buff Buoy. But not anymore! He's immature.",
                "summer_Fri": "I wonder what Buff Buoy is doing today...#$e#Huh? I didn't notice you standing there.",
                "winter_Sun": "Will you say hi to Buff Buoy for me?#$e#Thanks.",
                "winter_Sun6": "Um, if you see Buff Buoy could you tell him I'm busy today?#$e#Thanks."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Abigail",
            "Entries": {
                "Resort_Leaving": "I'm gonna ask Lannery if we can take the scenic route back.",
                "Resort_Bar": "Bobby made me a dark purple refresher, to match my hair. It tastes great!$h",
                "Resort": "Bummer... Lannery says we have to stay on the beach...$s#$b#And I brought my sword and everything...$s",
                "Fri2": "We're all going to hang out in the pizzeria this evening. It's kind of like a friday tradition, I guess."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Shane",
            "Entries": {
                "Potat_Crash": "Everyone is making a lot of fuss about that sweet potato..",
                "Wed8": "I guess I've grown attached to Oscar and Oliver. We're a ragtag bunch but it kind of feels like a weird family.#$e#I never really had much of a family as a kid.$s",
                "Sat4": "$d Joja#I'm renting my room from Oscar at a really good price. It's small but I can't complain.|If I could reset my life maybe I'd start a chicken farm. Only free-range eggs of course.",
                "Sat8": "I've really grown attached to Oscar's chickens.$h",
                "event_room1": "Okay... that'll require a great script. Maybe I'll ask Buoy for advice next time I see him at the saloon.$s"
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Emily",
            "Entries": {
                "Potat_Crash": "I can feel a positive energy emanating from that sweet potato.",
                "Mon8": "There's good people in this town who just can't seem to find happiness. It makes me sad.$u#$e#Working in the restaurant, I hear first-hand about everyone's problems.$u",
                "Tue": "I work part-time at Bobby' pizzeria. It pays the bills.",
                "Tue4": "I'm just working at Bobby' to make ends meet... but my real passion is tailoring.$u#$e#I made these clothes from scratch, see?",
                "summer_Tue6": "I feel bad for Nintendad. People judge him, but he's just living a different lifestyle.$u#$e#I wish everyone could learn to be accepting of others.",
                "summer_Fri": "If I wasn't so busy I'd come help you on the farm!#$e#But Bobby would be upset if I had another job...$s",
                "summer_Fri6": "You know, I'm sure Bobby would understand if I wanted to leave the pizzeria someday.#$b#There's so much out there, I can't stay a waitress forever.$u",
                "summer_Sat": "Don't overwork yourself!",
                "fall_Thu": "Are you friends with Clunt? He's a nice guy, if you get to know him.#$e#He gets lonely working in his shop all day. But he's so shy he has trouble making new friends.",
                "fall_Thu8": "I think Clunt's mad at me. He never looks at me anymore...$u#$e#I always thought we were friends.$u",
                "winter_Thu": "It must be so cold for the poor fish.$s#$e#I wonder if any fish hibernate? Maybe I should ask Buoy."
            }
        },
        {
            "Action": "EditData",
            "Target": "Characters/Dialogue/Clint",
            "Entries": {
                "Potat_Crash": "*sigh*... I wish Emily would talk to me about that crash.$s",
                "Introduction": "Er... hi. I'm Clunt.#$e#I'm the town blacksmith. If you ever need to upgrade your tools, I'm your guy.",
                "Resort_Shore_2": "I thought working a furnace would have prepared me for this heat, but I'm sweating in places I didn't know I could.$s#$e#I hope no one noticed...#$e#%Clunt's body is glistening..."
            }
        }
    ]
}